<?php

use yii\db\Migration;

/**
 * Class m180622_142742_stage
 */
class m180622_142742_stage extends Migration
{
    const TABLE = '{{%stage}}';

    /**
     * @return bool|void
     */
    public function safeUp()
    {
        $this->createTable(self::TABLE, [
            'stage_id' => $this->primaryKey(2),
            'stage_name' => $this->string(20),
            'stage_visitor' => $this->integer(3),
        ]);

        $this->batchInsert(self::TABLE, ['stage_name', 'stage_visitor'], [
            ['-', 90],
            ['1й тур', 100],
            ['2й тур', 100],
            ['3й тур', 100],
            ['4й тур', 100],
            ['5й тур', 100],
            ['6й тур', 100],
            ['7й тур', 100],
            ['8й тур', 100],
            ['9й тур', 100],
            ['10й тур', 100],
            ['11й тур', 100],
            ['12й тур', 100],
            ['13й тур', 100],
            ['14й тур', 100],
            ['15й тур', 100],
            ['16й тур', 100],
            ['17й тур', 100],
            ['18й тур', 100],
            ['19й тур', 100],
            ['20й тур', 100],
            ['21й тур', 100],
            ['22й тур', 100],
            ['23й тур', 100],
            ['24й тур', 100],
            ['25й тур', 100],
            ['26й тур', 100],
            ['27й тур', 100],
            ['28й тур', 100],
            ['29й тур', 100],
            ['30й тур', 100],
            ['31й тур', 100],
            ['32й тур', 100],
            ['33й тур', 100],
            ['34й тур', 100],
            ['35й тур', 100],
            ['36й тур', 100],
            ['37й тур', 100],
            ['38й тур', 100],
            ['39й тур', 100],
            ['40й тур', 100],
            ['41й тур', 100],
            ['1й ОР', 105],
            ['2й ОР', 105],
            ['3й ОР', 105],
            ['1й тур', 120],
            ['2й тур', 120],
            ['3й тур', 120],
            ['4й тур', 120],
            ['5й тур', 120],
            ['6й тур', 120],
            ['1/8 финала', 170],
            ['Четвертьфинал', 180],
            ['Полуфинал', 190],
            ['Финал', 200],
        ]);
    }

    /**
     * @return bool|void
     */
    public function safeDown()
    {
        $this->dropTable(self::TABLE);
    }
}
