<?php

use yii\db\Migration;

/**
 * Class m180622_142742_stage
 */
class m180622_142742_stage extends Migration
{
    const TABLE = '{{%stage}}';

    /**
     * @return bool|void
     */
    public function safeUp()
    {
        $this->createTable(self::TABLE, [
            'stage_id' => $this->primaryKey(2),
            'stage_name' => $this->string(20),
            'stage_visitor' => $this->integer(3),
        ]);

        $this->batchInsert(self::TABLE, ['stage_name', 'stage_visitor'], [
            ['-', 90],
            ['1-й тур', 100],
            ['2-й тур', 100],
            ['3-й тур', 100],
            ['4-й тур', 100],
            ['5-й тур', 100],
            ['6-й тур', 100],
            ['7-й тур', 100],
            ['8-й тур', 100],
            ['9-й тур', 100],
            ['10-й тур', 100],
            ['11-й тур', 100],
            ['12-й тур', 100],
            ['13-й тур', 100],
            ['14-й тур', 100],
            ['15-й тур', 100],
            ['16-й тур', 100],
            ['17-й тур', 100],
            ['18-й тур', 100],
            ['19-й тур', 100],
            ['20-й тур', 100],
            ['21-й тур', 100],
            ['22-й тур', 100],
            ['23-й тур', 100],
            ['24-й тур', 100],
            ['25-й тур', 100],
            ['26-й тур', 100],
            ['27-й тур', 100],
            ['28-й тур', 100],
            ['29-й тур', 100],
            ['30-й тур', 100],
            ['31-й тур', 100],
            ['32-й тур', 100],
            ['33-й тур', 100],
            ['34-й тур', 100],
            ['35-й тур', 100],
            ['36-й тур', 100],
            ['37-й тур', 100],
            ['38-й тур', 100],
            ['39-й тур', 100],
            ['40-й тур', 100],
            ['41-й тур', 100],
            ['1-й ОР', 105],
            ['2-й ОР', 105],
            ['3-й ОР', 105],
            ['1-й тур', 120],
            ['2-й тур', 120],
            ['3-й тур', 120],
            ['4-й тур', 120],
            ['5-й тур', 120],
            ['6-й тур', 120],
            ['1/8 финала', 170],
            ['Четвертьфинал', 180],
            ['Полуфинал', 190],
            ['Финал', 200],
        ]);
    }

    /**
     * @return bool|void
     */
    public function safeDown()
    {
        $this->dropTable(self::TABLE);
    }
}
