<?php

$q = array();

$q[] = 'CREATE TABLE `stage`
        (
            `stage_id` TINYINT(1) PRIMARY KEY AUTO_INCREMENT,
            `stage_name` VARCHAR(255) NOT NULL
        );';
$q[] = "INSERT INTO `stage` (`stage_name`)
        VALUES ('1 тур'),
               ('2 тур'),
               ('3 тур'),
               ('4 тур'),
               ('5 тур'),
               ('6 тур'),
               ('7 тур'),
               ('8 тур'),
               ('9 тур'),
               ('10 тур'),
               ('11 тур'),
               ('12 тур'),
               ('13 тур'),
               ('14 тур'),
               ('15 тур'),
               ('16 тур'),
               ('17 тур'),
               ('18 тур'),
               ('19 тур'),
               ('20 тур'),
               ('21 тур'),
               ('22 тур'),
               ('23 тур'),
               ('24 тур'),
               ('25 тур'),
               ('26 тур'),
               ('27 тур'),
               ('28 тур'),
               ('29 тур'),
               ('30 тур'),
               ('ОР1'),
               ('ОР2'),
               ('ОР3'),
               ('ОР4'),
               ('1/512'),
               ('1/256'),
               ('1/128'),
               ('1/64'),
               ('1/32'),
               ('1/16'),
               ('1/8'),
               ('1/4'),
               ('1/2'),
               ('Финал');";