<?php

set_time_limit(0);

include (__DIR__ . '/../include/include.php');

$sql = "INSERT INTO `user`
        SET `user_code`='f296a47aebb6b66620d44652a59db37a',
            `user_date_confirm`=0,
            `user_date_login`=UNIX_TIMESTAMP(),
            `user_date_register`=UNIX_TIMESTAMP(),
            `user_email`='fanat16rus@yandex.ru',
            `user_login`='Fanat16Rus',
            `user_password`='42f807e146b7db018c9560ea179535b6'";
f_igosja_mysqli_query($sql);

$sql = "INSERT INTO `user`
        SET `user_code`='883a889016dafef5c1c17d4227988ae1',
            `user_date_confirm`=0,
            `user_date_login`=UNIX_TIMESTAMP(),
            `user_date_register`=UNIX_TIMESTAMP(),
            `user_email`='pavel87desant38@gmail.com',
            `user_login`='Fanfar',
            `user_password`='6cee822c8723d6ff4c6470fbf66ed096'";
f_igosja_mysqli_query($sql);

$sql = "INSERT INTO `user`
        SET `user_code`='f622f133ec347c0ab5b5807f0ba8c9ba',
            `user_date_confirm`=UNIX_TIMESTAMP(),
            `user_date_login`=UNIX_TIMESTAMP(),
            `user_date_register`=UNIX_TIMESTAMP(),
            `user_email`='champion1969@ukr.net',
            `user_login`='champion1969',
            `user_password`='240196161e30b6b62d861d102091beed'";
f_igosja_mysqli_query($sql);

$sql = "INSERT INTO `user`
        SET `user_code`='7e1e9fb1fb5130d6d795ce1fd7efa661',
            `user_date_confirm`=0,
            `user_date_login`=UNIX_TIMESTAMP(),
            `user_date_register`=UNIX_TIMESTAMP(),
            `user_email`='denzell87@mail.ru',
            `user_login`='Denis_nk',
            `user_password`='84afc62d24cf1d0f58a4451f517ca1a1'";
f_igosja_mysqli_query($sql);

$sql = "INSERT INTO `user`
        SET `user_code`='d86e2fe366918eabd0875d7d58bfad99',
            `user_date_confirm`=UNIX_TIMESTAMP(),
            `user_date_login`=UNIX_TIMESTAMP(),
            `user_date_register`=UNIX_TIMESTAMP(),
            `user_email`='kamaretdinova2@rambler.ru',
            `user_login`='arsenal2',
            `user_password`='05063043f1168481304dacf76901af2c'";
f_igosja_mysqli_query($sql);

$sql = "INSERT INTO `user`
        SET `user_code`='d0f2887375f98b39cea2f8cee1761840',
            `user_date_confirm`=0,
            `user_date_login`=UNIX_TIMESTAMP(),
            `user_date_register`=UNIX_TIMESTAMP(),
            `user_email`='suronovos@mail.ru',
            `user_login`='suronovos',
            `user_password`='c4cebb3cf70d9ac033606682b796c5a9'";
f_igosja_mysqli_query($sql);

$sql = "INSERT INTO `user`
        SET `user_code`='27415f4d1d6b604a99754d451ec92c26',
            `user_date_confirm`=0,
            `user_date_login`=UNIX_TIMESTAMP(),
            `user_date_register`=UNIX_TIMESTAMP(),
            `user_email`='sdhgqnk75@mail.ru',
            `user_login`='Anthonywasse',
            `user_password`='bd414a156a5a5c493bf1ebbee650cccb'";
f_igosja_mysqli_query($sql);

$sql = "INSERT INTO `user`
        SET `user_code`='6eb62c17f8cd62f32c238f820f44f4c1',
            `user_date_confirm`=0,
            `user_date_login`=UNIX_TIMESTAMP(),
            `user_date_register`=UNIX_TIMESTAMP(),
            `user_email`='owen@1milliondollars.xyz',
            `user_login`='IsaacHab',
            `user_password`='cf12350f0de7344e7907740e266f516d'";
f_igosja_mysqli_query($sql);

$rus_name = array(
    'Александр',
    'Алексей',
    'Анатолий',
    'Андрей',
    'Антон',
    'Арсений',
    'Артём',
    'Артур',
    'Богдан',
    'Вадим',
    'Валерий',
    'Василий',
    'Виктор',
    'Виталий',
    'Владимир',
    'Владислав',
    'Вячеслав',
    'Георгий',
    'Глеб',
    'Григорий',
    'Даниил',
    'Денис',
    'Дмитрий',
    'Евгений',
    'Егор',
    'Иван',
    'Игорь',
    'Илья',
    'Кирилл',
    'Константин',
    'Максим',
    'Матвей',
    'Михаил',
    'Никита',
    'Николай',
    'Олег',
    'Павел',
    'Пётр',
    'Роман',
    'Руслан',
    'Святослав',
    'Семён',
    'Сергей',
    'Станислав',
    'Степан',
    'Тимофей',
    'Тимур',
    'Фёдор',
    'Юрий',
    'Ярослав',
);
$eng_name = array(
    'Адам',
    'Алекс',
    'Альберт',
    'Артур',
    'Арчи',
    'Бенджамин',
    'Блейк',
    'Бобби',
    'Гарри',
    'Генри',
    'Даниэль',
    'Декстер',
    'Джейден',
    'Джейк',
    'Джейкоб',
    'Джейми',
    'Джеймс',
    'Джек',
    'Дженсон',
    'Джозеф',
    'Джордж',
    'Джошуа',
    'Джуд',
    'Дилан',
    'Дэвид',
    'Итан',
    'Кай',
    'Каллум',
    'Коннор',
    'Кэмерон',
    'Лео',
    'Леон',
    'Логан',
    'Луис',
    'Лукас',
    'Льюис',
    'Люк',
    'Майкл',
    'Макс',
    'Мейсон',
    'Мэтью',
    'Натан',
    'Оливер',
    'Олли',
    'Оскар',
    'Остин',
    'Оуэн',
    'Райан',
    'Райли',
    'Роберт',
    'Ронни',
    'Рубен',
    'Себастьян',
    'Сонни',
    'Стэнли',
    'Тайлер',
    'Тедди',
    'Тео',
    'Теодор',
    'Тоби',
    'Томас',
    'Томми',
    'Уильям',
    'Феликс',
    'Финли',
    'Фредди',
    'Фредерик',
    'Фрэнки',
    'Харви',
    'Харли',
    'Харрисон',
    'Хьюго',
    'Чарльз',
    'Эван',
    'Эдвард',
    'Эйден',
    'Элайджа',
    'Эллиот',
);
$che_name = array(
    'Дэвид',
    'Зденек',
    'Иаков',
    'Иржи',
    'Йозеф',
    'Карел',
    'Ладислав',
    'Лукаш',
    'Майкл',
    'Мартин',
    'Милан',
    'Мирослав',
    'Питер',
    'Пол',
    'Томас',
    'Ярослав',
);
$ger_name = array(
    'Александр',
    'Андреас',
    'Берд',
    'Вальтер',
    'Вацлав',
    'Вернер',
    'Владимир',
    'Вольфганг',
    'Ганс',
    'Гельмут',
    'Герхард',
    'Горст',
    'Гюнтер',
    'Джон',
    'Дитер',
    'Йенс',
    'Йорг',
    'Клаус',
    'Кристиан',
    'Манфред',
    'Мартин',
    'Матиас',
    'Михаель',
    'Питер',
    'Рольф',
    'Свен',
    'Стефан',
    'Томас',
    'Торстен',
    'Уве',
    'Франк',
    'Хайнс',
    'Юрген',
);

$name_array = array(
    array(
        'country' => 'Канада',
        'list' => $eng_name,
    ),
    array(
        'country' => 'Россия',
        'list' => $rus_name,
    ),
    array(
        'country' => 'США',
        'list' => $eng_name,
    ),
    array(
        'country' => 'Финляндия',
        'list' => array(
            'Антеро',
            'Антти',
            'Ильмари',
            'Йоханнес',
            'Калеви',
            'Кари',
            'Матиас',
            'Матти',
            'Микаэль',
            'Олави',
            'Оливер',
            'Онни',
            'Пекка',
            'Пентти',
            'Тапани',
            'Тапио',
            'Тимо',
            'Хейкки',
            'Элиас',
            'Эркки',
            'Ээмели',
            'Юхани',
        ),
    ),
    array(
        'country' => 'Швеция',
        'list' => array(
            'Александр',
            'Андерс',
            'Андреас',
            'Бенгт',
            'Бу',
            'Гуннар',
            'Густав',
            'Даниель',
            'Йоран',
            'Карл',
            'Кристер',
            'Ларс',
            'Леннарт',
            'Магнус',
            'Мартин',
            'Микаель',
            'Нильс',
            'Оке',
            'Оскар',
            'Пер',
            'Петер',
            'Свен',
            'Стефан',
            'Томас',
            'Улоф',
            'Фредрик',
            'Ханс',
            'Эрик',
            'Юхан',
            'Ян',
        ),
    ),
    array(
        'country' => 'Чехия',
        'list' => $che_name,
    ),
    array(
        'country' => 'Швейцария',
        'list' => $ger_name,
    ),
    array(
        'country' => 'Словакия',
        'list' => $che_name,
    ),
    array(
        'country' => 'Белоруссия',
        'list' => $rus_name,
    ),
    array(
        'country' => 'Германия',
        'list' => $ger_name,
    ),
    array(
        'country' => 'Норвегия',
        'list' => array(
            'Александр',
            'Арне',
            'Бйорн',
            'Йонас',
            'Кнут',
            'Кристиан',
            'Кьелл',
            'Ларс',
            'Лукас',
            'Магнус',
            'Маркус',
            'Матиас',
            'Оле',
            'Оливер',
            'Свейн',
            'Тобиас',
            'Томас',
            'Уильям',
            'Филип',
            'Эмиль',
            'Ян',
        ),
    ),
    array(
        'country' => 'Украина',
        'list' => $rus_name,
    ),
);

foreach ($name_array as $country)
{
    $country_name = $country['country'];

    $sql = "SELECT `country_id`
            FROM `country`
            WHERE `country_name`='$country_name'
            LIMIT 1";
    $country_sql = f_igosja_mysqli_query($sql);

    $country_array = $country_sql->fetch_all(1);

    $country_id = $country_array[0]['country_id'];

    foreach ($country['list'] as $item)
    {
        $sql = "SELECT `name_id`
                FROM `name`
                WHERE `name_name`='$item'
                LIMIT 1";
        $name_sql = f_igosja_mysqli_query($sql);

        if (0 == $name_sql->num_rows)
        {
            $sql = "INSERT INTO `name`
                    SET `name_name`='$item'";
            f_igosja_mysqli_query($sql);

            $name_id = $mysqli->insert_id;
        }
        else
        {
            $nam_array = $name_sql->fetch_all(1);

            $name_id = $nam_array[0]['name_id'];
        }

        $sql = "INSERT INTO `namecountry`
                SET `namecountry_country_id`=$country_id,
                    `namecountry_name_id`=$name_id";
        f_igosja_mysqli_query($sql);
    }

    usleep(1);

    print '.';
    flush();
}

$eng_surname = array(
    'Абрамсон',
    'Адамсон',
    'Аддерли',
    'Аддингтон',
    'Адриан',
    'Албертсон',
    'Андерсон',
    'Арнолд',
    'Артурз',
    'Арчибальд',
    'Аттвуд',
    'Атчесон',
    'Бабкок',
    'Бакер',
    'Барджман',
    'Барнз',
    'Баррингтон',
    'Бауэрман',
    'Бекер',
    'Бенсон',
    'Беррингтон',
    'Берч',
    'Бишоп',
    'Блер',
    'Блумфилд',
    'Блэк',
    'Бозуорт',
    'Болдуин',
    'Брадберри',
    'Брадшо',
    'Бреун',
    'Брикман',
    'Брукс',
    'Булман',
    'Бутман',
    'Буш',
    'Ване',
    'Вон',
    'Вуд',
    'Галбрейт',
    'Гарднер',
    'Гаррисон',
    'Гастман',
    'Гейт',
    'Гиббз',
    'Гилберт',
    'Гилл',
    'Гилмор',
    'Гилсон',
    'Голдман',
    'Гудман',
    'Даглас',
    'Дайсон',
    'Далтон',
    'Дане',
    'Данкан',
    'Даньелз',
    'Дарем',
    'Дауман',
    'Дей',
    'Дейвидсон',
    'Деррик',
    'Джейкобсон',
    'Джеймз',
    'Дженкин',
    'Джералд',
    'Джером',
    'Джефф',
    'Джимсон',
    'Джонсон',
    'Джоунз',
    'Дикинсон',
    'Дин',
    'Додсон',
    'Доналдсон',
    'Донован',
    'Калхоун',
    'Камбелл',
    'Каррингтон',
    'Картер',
    'Келли',
    'Кендал',
    'Кеннеди',
    'Кеннет',
    'Керк',
    'Кингзман',
    'Кит',
    'Клиффорд',
    'Клэптон',
    'Конорс',
    'Коулман',
    'Крайтон',
    'Крамер',
    'Кроссман',
    'Крофтон',
    'Куинси',
    'Кук',
    'Кэри',
    'Кэрролл',
    'Ламберте',
    'Ларкинз',
    'Леман',
    'Ливингстон',
    'Липман',
    'Литтл',
    'Ломан',
    'Лонгман',
    'Луин',
    'Лэрд',
    'Майерз',
    'Майклсон',
    'Макадам',
    'Макалистер',
    'Макдафф',
    'Макдоналд',
    'Макензи',
    'Мансфилд',
    'Марлоу',
    'Маршман',
    'Мейси',
    'Мейсон',
    'Мерсер',
    'Мерфи',
    'Метьюз',
    'Миллер',
    'Милн',
    'Милтон',
    'Моллиган',
    'Моррисон',
    'Найман',
    'Невилл',
    'Нейтан',
    'Нельсон',
    'Николсон',
    'Нил',
    'Нэш',
    'Огден',
    'Одли',
    'Озборн',
    'Озуалд',
    'Олдридж',
    'Оливер',
    'Оллфорд',
    'Олсопп',
    'Остин',
    'Оукман',
    'Оулдман',
    'Оулдридж',
    'Оутис',
    'Оуэн',
    'Палмер',
    'Паркинсон',
    'Парсон',
    'Пасс',
    'Патерсон',
    'Пейдж',
    'Пикок',
    'Пирси',
    'Питерсон',
    'Портер',
    'Райдер',
    'Ралфс',
    'Рамзи',
    'Рассел',
    'Ренолдз',
    'Ричардз',
    'Роберте',
    'Роджер',
    'Роли',
    'Сайке',
    'Саймон',
    'Самьюэлз',
    'Симпсон',
    'Смит',
    'Солсбури',
    'Сондер',
    'Станли',
    'Стивен',
    'Стивенсон',
    'Тафт',
    'Тейлор',
    'Тернер',
    'Тиммонз',
    'Томсон',
    'Торндайк',
    'Торнтон',
    'Трейси',
    'Уайт',
    'Уилкинсон',
    'Уинтер',
    'Уокман',
    'Уоллер',
    'Уоллис',
    'Уолтер',
    'Уорд',
    'Уоррен',
    'Уотсон',
    'Уэбстер',
    'Уэзли',
    'Уэйн',
    'Уэйнрайт',
    'Фармер',
    'Фаррелл',
    'Фейбер',
    'Фейн',
    'Фергусон',
    'Филипс',
    'Финч',
    'Фитцджералд',
    'Фишер',
    'Фланнаган',
    'Флеминг',
    'Флетчер',
    'Форд',
    'Форман',
    'Форстер',
    'Фостер',
    'Франсис',
    'Фрейзер',
    'Фриман',
    'Фултон',
    'Хамфри',
    'Хардман',
    'Харрисон',
    'Хауард',
    'Хейг',
    'Хейли',
    'Хенкок',
    'Хиггинз',
    'Хоггарт',
    'Ходжез',
    'Хокинз',
    'Холидей',
    'Хоулмз',
    'Чандлер',
    'Чапман',
    'Чарлсон',
    'Честертон',
    'Шакпи',
    'Шелдон',
    'Шерлок',
    'Шортер',
    'Эванз',
    'Эддингтон',
    'Эдуардз',
    'Эллингтон',
    'Элмерз',
    'Эндерсон',
    'Эндрюз',
    'Эриксон',
    'Эртон',
    'Юманз',
    'Янг',
);
$che_surname = array(

);
$ger_surname = array(
    'Айзенбергер',
    'Арендт',
    'Ауэр',
    'Балдуин',
    'Бальдауф',
    'Беккер',
    'Бертольд',
    'Биккель',
    'Биссинг',
    'Битнер',
    'Блюментрост',
    'Борман',
    'Бромберг',
    'Брюгеман',
    'Буркхард',
    'Бюркель',
    'Вайнцирль',
    'Вайсс',
    'Вейсе',
    'Вигман',
    'Витте',
    'Влах',
    'Вольф',
    'Вульф',
    'Гартвиг',
    'Гейбель',
    'Гейнрих',
    'Геркан',
    'Герстер',
    'Герц',
    'Гёте',
    'Гилен',
    'Гиммлер',
    'Гирш',
    'Глаубер',
    'Гофман',
    'Гоффман',
    'Греф',
    'Гримм',
    'Гутцайт',
    'Гюнтер',
    'Дайс',
    'Даммер',
    'Дейс',
    'Диппель',
    'Зайдель',
    'Зак',
    'Закс',
    'Зауэр',
    'Зееман',
    'Зутер',
    'Кантор',
    'Кауфман',
    'Кауц',
    'Кауэр',
    'Кёрберы',
    'Кёстер',
    'Киршнер',
    'Клее',
    'Кобленц',
    'Кольб',
    'Кольбе',
    'Копп',
    'Коссман',
    'Крампе',
    'Краус',
    'Крекер',
    'Кромберг',
    'Кромбергер',
    'Кронберг',
    'Кронбергер',
    'Куглер',
    'Кунц',
    'Кунце',
    'Куш',
    'Лампрехт',
    'Ланге',
    'Ланген',
    'Лангман',
    'Лаубе',
    'Леманн',
    'Лехнер',
    'Либерт',
    'Липпс',
    'Майер',
    'Майор',
    'Маутнер',
    'Мёбиус',
    'Мёллендорф',
    'Мердер',
    'Мильх',
    'Мюллер',
    'Нотбек',
    'Остхофф',
    'Охман',
    'Перл',
    'Петерман',
    'Прейер',
    'Прейслер',
    'Прёппер',
    'Пресслер',
    'Пургольд',
    'Раух',
    'Ребер',
    'Ренн',
    'Ригер',
    'Ридель',
    'Розенберг',
    'Рохау',
    'Рутцен',
    'Рюстов',
    'Тапперт',
    'Таузиг',
    'Тёплиц',
    'Тилль',
    'Тойрер',
    'Ульбрихт',
    'Умлауф',
    'Фишер',
    'Фон Фейербах',
    'Франк',
    'Хаазе',
    'Хелльберг',
    'Хиппель',
    'Хопп',
    'Хоффман',
    'Хоффманн',
    'Христманн',
    'Цапф',
    'Ципсер',
    'Шауман',
    'Шёнау',
    'Шетелих',
    'Шильдкнехт',
    'Шпиндлер',
    'Шпитта',
    'Шпор',
    'Шрайер',
    'Шрейер',
    'Штанге',
    'Штрекер',
    'Шульц',
    'Шумахер',
    'Шуппе',
    'Эркерт',
);
$che_surname = array(
    'Барта',
    'Бартош',
    'Барштипан',
    'Беднарж',
    'Безуха',
    'Бенеш',
    'Беран',
    'Беранек',
    'Билек',
    'Блага',
    'Блажек',
    'Брож',
    'Буреш',
    'Вавра',
    'Валента',
    'Ванек',
    'Вацек',
    'Веселый',
    'Витек',
    'Влчек',
    'Вопичка',
    'Гавел',
    'Гавличек',
    'Голуб',
    'Горак',
    'Горачек',
    'Груда',
    'Грушка',
    'Дворжак',
    'Долежал',
    'Достал',
    'Душек',
    'Елинек',
    'Земан',
    'Кадлец',
    'Кашпар',
    'Коварж',
    'Коларж',
    'Конечный',
    'Копецкий',
    'Крал',
    'Краус',
    'Кржиж',
    'Кубичек',
    'Кучера',
    'Лишка',
    'Малый',
    'Марек',
    'Мареш',
    'Матейка',
    'Матоушек',
    'Мах',
    'Махачек',
    'Машек',
    'Моравец',
    'Мусил',
    'Мюллер',
    'Навратил',
    'Недухал',
    'Немец',
    'Немечек',
    'Нетрвал',
    'Новак',
    'Новотный',
    'Овчачик',
    'Павлик',
    'Пешан',
    'Правец',
    'Прокоп',
    'Прохазка',
    'Ржига',
    'Рохла',
    'Ружичка',
    'Свобода',
    'Седлак',
    'Седлачек',
    'Славик',
    'Соукуп',
    'Станек',
    'Табор',
    'Тихий',
    'Тобишка',
    'Томан',
    'Урбан',
    'Фишер',
    'Чермак',
    'Черный',
    'Чех',
    'Швец',
    'Шевчик',
    'Шимек',
    'Шмид',
    'Шпрингл',
    'Штепанек',
    'Эстерка',
    'Янда',
    'Ярош',
);

$surname_array = array(
    array(
        'country' => 'Канада',
        'list' => $eng_surname,
    ),
    array(
        'country' => 'Россия',
        'list' => array(
            'Абрамов',
            'Авдеев',
            'Агапов',
            'Агафонов',
            'Агеев',
            'Акимов',
            'Аксёнов',
            'Александров',
            'Алексеев',
            'Алёхин',
            'Алёшин',
            'Андреев',
            'Андрианов',
            'Аникин',
            'Анисимов',
            'Анохин',
            'Антипов',
            'Антонов',
            'Артамонов',
            'Артёмов',
            'Архипов',
            'Астафьев',
            'Астахов',
            'Афанасьев',
            'Бабушкин',
            'Баженов',
            'Балашов',
            'Баранов',
            'Барсуков',
            'Басов',
            'Безруков',
            'Беликов',
            'Белкин',
            'Белов',
            'Белоусов',
            'Беляев',
            'Беляков',
            'Берёзин',
            'Беспалов',
            'Бессонов',
            'Бирюков',
            'Блинов',
            'Блохин',
            'Бобров',
            'Богданов',
            'Богомолов',
            'Болдырев',
            'Большаков',
            'Бондарёв',
            'Борисов',
            'Бородин',
            'Бочаров',
            'Булатов',
            'Булгаков',
            'Буров',
            'Быков',
            'Бычков',
            'Вавилов',
            'Васильев',
            'Вдовин',
            'Верещагин',
            'Вешняков',
            'Виноградов',
            'Винокуров',
            'Вишневский',
            'Владимиров',
            'Власов',
            'Волков',
            'Волошин',
            'Воробьёв',
            'Воронин',
            'Воронков',
            'Воронов',
            'Воронцов',
            'Высоцкий',
            'Гаврилов',
            'Галкин',
            'Герасимов',
            'Гладков',
            'Глебов',
            'Глухов',
            'Глушков',
            'Голиков',
            'Голованов',
            'Головин',
            'Голубев',
            'Гончаров',
            'Горбачёв',
            'Горбунов',
            'Гордеев',
            'Горелов',
            'Горлов',
            'Горохов',
            'Горшков',
            'Горюнов',
            'Горячёв',
            'Грачёв',
            'Греков',
            'Грибов',
            'Григорьев',
            'Гришин',
            'Громов',
            'Губанов',
            'Гуляев',
            'Гуров',
            'Гусев',
            'Гущин',
            'Давыдов',
            'Данилов',
            'Дегтярёв',
            'Дементьев',
            'Демидов',
            'Дёмин',
            'Демьянов',
            'Денисов',
            'Дмитриев',
            'Добрынин',
            'Долгов',
            'Дорофеев',
            'Дорохов',
            'Дроздов',
            'Дружинин',
            'Дубинин',
            'Дубов',
            'Дубровин',
            'Дьяков',
            'Дьяконов',
            'Евдокимов',
            'Евсеев',
            'Егоров',
            'Ежов',
            'Елизаров',
            'Елисеев',
            'Емельянов',
            'Еремеев',
            'Ерёмин',
            'Ермаков',
            'Ермилов',
            'Ермолаев',
            'Ермолов',
            'Ерофеев',
            'Ершов',
            'Ефимов',
            'Ефремов',
            'Жаров',
            'Жданов',
            'Жилин',
            'Жуков',
            'Журавлёв',
            'Завьялов',
            'Зайцев',
            'Захаров',
            'Зверев',
            'Звягинцев',
            'Зеленин',
            'Зимин',
            'Зиновьев',
            'Злобин',
            'Золотарёв',
            'Золотов',
            'Зорин',
            'Зотов',
            'Зубков',
            'Зубов',
            'Зуев',
            'Зыков',
            'Иванов',
            'Игнатов',
            'Игнатьев',
            'Измайлов',
            'Ильин',
            'Ильинский',
            'Исаев',
            'Исаков',
            'Казаков',
            'Казанцев',
            'Калачёв',
            'Калашников',
            'Калинин',
            'Калмыков',
            'Калугин',
            'Капустин',
            'Карасёв',
            'Карпов',
            'Карташов',
            'Касаткин',
            'Касьянов',
            'Киреев',
            'Кириллов',
            'Киселёв',
            'Климов',
            'Клюев',
            'Князев',
            'Ковалёв',
            'Кожевников',
            'Козин',
            'Козлов',
            'Козловский',
            'Козырёв',
            'Колесников',
            'Колесов',
            'Колосов',
            'Колпаков',
            'Кольцов',
            'Комаров',
            'Комиссаров',
            'Кондратов',
            'Кондратьев',
            'Кондрашов',
            'Коновалов',
            'Кононов',
            'Константинов',
            'Копылов',
            'Корнев',
            'Корнеев',
            'Корнилов',
            'Коровин',
            'Королёв',
            'Корольков',
            'Коротков',
            'Корчагин',
            'Коршунов',
            'Косарёв',
            'Костин',
            'Котов',
            'Кочергин',
            'Кочетков',
            'Кочетов',
            'Кошелев',
            'Кравцов',
            'Краснов',
            'Круглов',
            'Крылов',
            'Крюков',
            'Крючков',
            'Кудрявцев',
            'Кудряшов',
            'Кузин',
            'Кузнецов',
            'Кузьмин',
            'Кукушкин',
            'Кулагин',
            'Кулаков',
            'Кулешов',
            'Куликов',
            'Куприянов',
            'Курочкин',
            'Лаврентьев',
            'Лавров',
            'Лазарев',
            'Лапин',
            'Лаптев',
            'Лапшин',
            'Ларин',
            'Ларионов',
            'Латышев',
            'Лебедев',
            'Левин',
            'Леонов',
            'Леонтьев',
            'Литвинов',
            'Лобанов',
            'Логинов',
            'Лопатин',
            'Лосев',
            'Лукин',
            'Лукьянов',
            'Лыков',
            'Львов',
            'Любимов',
            'Майоров',
            'Макаров',
            'Макеев',
            'Максимов',
            'Малахов',
            'Малинин',
            'Малышев',
            'Мальцев',
            'Маркелов',
            'Маркин',
            'Марков',
            'Мартынов',
            'Масленников',
            'Маслов',
            'Матвеев',
            'Медведев',
            'Мельников',
            'Меркулов',
            'Мешков',
            'Мещеряков',
            'Минаев',
            'Минин',
            'Миронов',
            'Митрофанов',
            'Михайлов',
            'Михеев',
            'Моисеев',
            'Молчанов',
            'Моргунов',
            'Морозов',
            'Москвин',
            'Муравьёв',
            'Муратов',
            'Мухин',
            'Назаров',
            'Наумов',
            'Некрасов',
            'Нестеров',
            'Нефёдов',
            'Нечаев',
            'Никитин',
            'Никифоров',
            'Николаев',
            'Никольский',
            'Никонов',
            'Никулин',
            'Новиков',
            'Носков',
            'Носов',
            'Овсянников',
            'Овчинников',
            'Одинцов',
            'Озёров',
            'Окулов',
            'Олейников',
            'Орехов',
            'Орлов',
            'Осипов',
            'Островский',
            'Павлов',
            'Павловский',
            'Панин',
            'Панков',
            'Панкратов',
            'Панов',
            'Пантелеев',
            'Панфилов',
            'Парамонов',
            'Парфёнов',
            'Пастухов',
            'Пахомов',
            'Петров',
            'Петровский',
            'Петухов',
            'Пименов',
            'Пирогов',
            'Платонов',
            'Плотников',
            'Поздняков',
            'Покровский',
            'Поликарпов',
            'Поляков',
            'Пономарёв',
            'Попов',
            'Постников',
            'Потапов',
            'Прокофьев',
            'Прохоров',
            'Пугачёв',
            'Раков',
            'Рогов',
            'Родин',
            'Родионов',
            'Рожков',
            'Розанов',
            'Романов',
            'Рубцов',
            'Рудаков',
            'Руднев',
            'Румянцев',
            'Русаков',
            'Русанов',
            'Рыбаков',
            'Рыжов',
            'Рябинин',
            'Рябов',
            'Савельев',
            'Савин',
            'Савицкий',
            'Сазонов',
            'Сальников',
            'Самойлов',
            'Самсонов',
            'Сафонов',
            'Сахаров',
            'Свешников',
            'Свиридов',
            'Севастьянов',
            'Седов',
            'Селезнёв',
            'Селиванов',
            'Семенов',
            'Сёмин',
            'Сергеев',
            'Серебряков',
            'Серов',
            'Сидоров',
            'Сизов',
            'Симонов',
            'Синицын',
            'Ситников',
            'Скворцов',
            'Смирнов',
            'Снегирёв',
            'Соболёв',
            'Соколов',
            'Соловьёв',
            'Сомов',
            'Сорокин',
            'Сотников',
            'Софронов',
            'Спиридонов',
            'Стариков',
            'Старостин',
            'Степанов',
            'Столяров',
            'Субботин',
            'Суворов',
            'Судаков',
            'Сурков',
            'Суслов',
            'Суханов',
            'Сухарёв',
            'Сухов',
            'Сычёв',
            'Тарасов',
            'Терентьев',
            'Терехов',
            'Тимофеев',
            'Титов',
            'Тихомиров',
            'Тихонов',
            'Ткачёв',
            'Токарев',
            'Толкачёв',
            'Третьяков',
            'Трифонов',
            'Троицкий',
            'Трофимов',
            'Трошин',
            'Туманов',
            'Уваров',
            'Ульянов',
            'Усов',
            'Успенский',
            'Устинов',
            'Уткин',
            'Ушаков',
            'Фадеев',
            'Фёдоров',
            'Федосеев',
            'Федосов',
            'Федотов',
            'Фетисов',
            'Филатов',
            'Филимонов',
            'Филиппов',
            'Фирсов',
            'Фокин',
            'Фомин',
            'Фомичёв',
            'Фролов',
            'Харитонов',
            'Хомяков',
            'Хохлов',
            'Хромов',
            'Худяков',
            'Царёв',
            'Цветков',
            'Чеботарёв',
            'Черепанов',
            'Черкасов',
            'Чернов',
            'Чёрный',
            'Черных',
            'Чернышов',
            'Черняев',
            'Чесноков',
            'Чижов',
            'Чистяков',
            'Чумаков',
            'Шаповалов',
            'Шапошников',
            'Шаров',
            'Швецов',
            'Шевелёв',
            'Шевцов',
            'Шестаков',
            'Шилов',
            'Широков',
            'Ширяев',
            'Шишкин',
            'Шмелёв',
            'Шубин',
            'Шувалов',
            'Шульгин',
            'Щеглов',
            'Щербаков',
            'Щукин',
            'Юдин',
            'Яковлев',
            'Яшин',
        ),
    ),
    array(
        'country' => 'США',
        'list' => $eng_surname,
    ),
    array(
        'country' => 'Финляндия',
        'list' => array(
            'Аалто',
            'Аалтонен',
            'Анттила',
            'Ахо',
            'Ахола',
            'Ахонен',
            'Бекман',
            'Бломквист',
            'Викстрем',
            'Виртанен',
            'Вялсянен',
            'Йокинен',
            'Каллио',
            'Карьялайнен',
            'Койвисто',
            'Корхонен',
            'Коскела',
            'Коски',
            'Коскинен',
            'Лааксо',
            'Лахти',
            'Лейно',
            'Лехтонен',
            'Линдквист',
            'Линдстрем',
            'Линдхолм',
            'Маттила',
            'Миккола',
            'Мякеля',
            'Мяки',
            'Мякинен',
            'Ниемеля',
            'Ниеми',
            'Ниеминен',
            'Нурми',
            'Нюман',
            'Ойяла',
            'Оксанен',
            'Партанен',
            'Пелтола',
            'Питкянен',
            'Рантала',
            'Рантанен',
            'Раяла',
            'Рясянен',
            'Саари',
            'Сааринен',
            'Саволайнен',
            'Сало',
            'Сеппяля',
            'Снеллман',
            'Тойвонен',
            'Турунен',
            'Хакала',
            'Халонен',
            'Харью',
            'Хейккиля',
            'Хирвонен',
            'Хямяляйнен',
            'Эклунд',
            'Экман',
            'Ярвинен',
        ),
    ),
    array(
        'country' => 'Швеция',
        'list' => array(
            'Абрамссон',
            'Акселссон',
            'Али',
            'Андерссон',
            'Андреассон',
            'Ардвидссон',
            'Бенгтссон',
            'Берг',
            'Берггрен',
            'Бергквист',
            'Берглунд',
            'Бергман',
            'Бергстрём',
            'Блум',
            'Блумквист',
            'Бьёрк',
            'Бьёрклунд',
            'Валлин',
            'Виклунд',
            'Викстрём',
            'Гуннарссон',
            'Густафссон',
            'Дальберг',
            'Даниелссон',
            'Ёнссон',
            'Исакссон',
            'Карлссон',
            'Клаессон',
            'Ларссон',
            'Линд',
            'Линдберг',
            'Линдгрен',
            'Линдквист',
            'Линдстрём',
            'Линдхольм',
            'Лофгрен',
            'Лунд',
            'Лундберг',
            'Лундгрен',
            'Лундин',
            'Лундквист',
            'Лундстрём',
            'Магнуссон',
            'Мартинссон',
            'Маттссон',
            'Монссон',
            'Мортенссон',
            'Мухаммед',
            'Нильссон',
            'Норберг',
            'Нордин',
            'Нордстрём',
            'Нюберг',
            'Нюстрём',
            'Оберг',
            'Оберг',
            'Окессон',
            'Острём',
            'Перссон',
            'Петерссон',
            'Полссон',
            'Самуелссон',
            'Сандберг',
            'Сандстрём',
            'Свенссон',
            'Сёдерберг',
            'Стрём',
            'Стрёмберг',
            'Сундберг',
            'Сундстрём',
            'Сьёберг',
            'Сьёгрен',
            'Улофссон',
            'Улссон',
            'Фальк',
            'Форсберг',
            'Франссон',
            'Фредрикссон',
            'Хансен',
            'Ханссон',
            'Хедлунд',
            'Хеллстрём',
            'Хенрикссон',
            'Херманссон',
            'Хоканссон',
            'Хольм',
            'Хольмберг',
            'Хольмгрен',
            'Хольмквист',
            'Эк',
            'Эклунд',
            'Экстрём',
            'Элиассон',
            'Энгстрём',
            'Эрикссон',
            'Юнассон',
            'Юнссон',
            'Юханссон',
            'Якобссон',
            'Янссон',
        ),
    ),
    array(
        'country' => 'Чехия',
        'list' => $che_surname,
    ),
    array(
        'country' => 'Швейцария',
        'list' => $ger_surname,
    ),
    array(
        'country' => 'Словакия',
        'list' => $che_surname,
    ),
    array(
        'country' => 'Белоруссия',
        'list' => array(
            'Бабич',
            'Балицкий',
            'Барщевский',
            'Басинский',
            'Белявский',
            'Богданович',
            'Буковский',
            'Виленский',
            'Владомирский',
            'Высоцкий',
            'Гармаш',
            'Голуб',
            'Голубовский',
            'Гончарук',
            'Гриб',
            'Дедюшко',
            'Дзюба',
            'Захаревич',
            'Зенкевич',
            'Зинкевич',
            'Ивашкевич',
            'Ковальчук',
            'Ковзик',
            'Кондратович',
            'Коник',
            'Корбут',
            'Крачковский',
            'Кудря',
            'Кулешов',
            'Линник',
            'Лукашевич',
            'Лукашенко',
            'Любич',
            'Майсак',
            'Макаревич',
            'Маслюков',
            'Мисюк',
            'Мицкевич',
            'Мошковский',
            'Нестеренко',
            'Пилипенко',
            'Подобед',
            'Позняк',
            'Полещук',
            'Полищук',
            'Полонский',
            'Попович',
            'Ряховский',
            'Самойлович',
            'Санько',
            'Сапега',
            'Сенкевич',
            'Середа',
            'Сикорский',
            'Скворцов',
            'Скворцова',
            'Смоляк',
            'Сологуб',
            'Сосновский',
            'Туронок',
            'Тышкевич',
            'Филипенко',
            'Хруцкий',
            'Чижевский',
            'Шкляр',
            'Шпак',
            'Юровский',
            'Юшкевич',
            'Янукович',
            'Янушкевич',
        ),
    ),
    array(
        'country' => 'Германия',
        'list' => $ger_surname,
    ),
    array(
        'country' => 'Норвегия',
        'list' => array(
            'Абрахамсен',
            'Амундсен',
            'Андерсен',
            'Андреассен',
            'Анскеланн',
            'Антонсен',
            'Арнесен',
            'Аронсен',
            'Аск',
            'Бакке',
            'Баккен',
            'Берг',
            'Берге',
            'Бергер',
            'Бернтсен',
            'Бёрресен',
            'Биркеланн',
            'Борге',
            'Борген',
            'Брекке',
            'Бротен',
            'Бьерке',
            'Бьёрнштад',
            'Викен',
            'Воге',
            'Габриэльсен',
            'Гульбрандсен',
            'Гундерсен',
            'Густавсен',
            'Гуттормсен',
            'Давидсен',
            'Дале',
            'Дален',
            'Даль',
            'Даниэльсен',
            'Дидриксен',
            'Иверсен',
            'Ингвальдсен',
            'Исаксен',
            'Йелле',
            'Йенсен',
            'Йенссен',
            'Йерде',
            'Йертсен',
            'Йоргенсен',
            'Карлсен',
            'Карлсон',
            'Карлссон',
            'Касперсен',
            'Клаусен',
            'Клеппе',
            'Кнудсен',
            'Кнутсен',
            'Корнелиуссен',
            'Кристенсен',
            'Кристиансен',
            'Кристоферсен',
            'Лангеланн',
            'Ларсен',
            'Ларссен',
            'Лауритсен',
            'Лёкен',
            'Лёккен',
            'Линдберг',
            'Лорентсен',
            'Лунн',
            'Людвигсен',
            'Магнуссен',
            'Мадсен',
            'Маркуссен',
            'Мартинсен',
            'Матисен',
            'Мёллер',
            'Микальсен',
            'Миккельсен',
            'Мортенсен',
            'Нессе',
            'Нильсен',
            'Нордли',
            'Нюгор',
            'Ольсен',
            'Омодт',
            'Ос',
            'Осе',
            'Осен',
            'Паульсен',
            'Педерсен',
            'Расмуссен',
            'Рёд',
            'Рённинг',
            'Рённинген',
            'Самуэльсен',
            'Сёренсен',
            'Сивертсен',
            'Сименсен',
            'Симонсен',
            'Скоглунн',
            'Слеттебакк',
            'Слеттен',
            'Стене',
            'Сульберг',
            'Сунде',
            'Тённессен',
            'Толлефсен',
            'Томассен',
            'Торвальдсен',
            'Торгерсен',
            'Торнбьёрнсен',
            'Торсен',
            'Торстенсен',
            'Улафсен',
            'Ульриксен',
            'Фарштад',
            'Финштад',
            'Фоссе',
            'Франтсен',
            'Фредриксен',
            'Хаген',
            'Хальворсен',
            'Хансен',
            'Ханссен',
            'Харальдсен',
            'Хелланн',
            'Хелле',
            'Хельгесен',
            'Хенриксен',
            'Хермансен',
            'Хетланн',
            'Ховланн',
            'Хоконсен',
            'Холанн',
            'Холен',
            'Хольм',
            'Хольмен',
            'Хольт',
            'Хольте',
            'Хольтер',
            'Хофф',
            'Эвенсен',
            'Эверланн',
            'Эгген',
            'Эгеланн',
            'Эдвардсен',
            'Эдегор',
            'Экланн',
            'Элиассен',
            'Эллефсен',
            'Эллингсен',
            'Энгебретсен',
            'Энген',
            'Энгер',
            'Эндресен',
            'Эноксен',
            'Эрвик',
            'Эриксен',
            'Эрикссон',
            'Эрландсен',
            'Эспеланн',
            'Эуне',
            'Эуштад',
            'Юханнессен',
            'Юхансен',
            'Якобсен',
            'Янсен',
        ),
    ),
    array(
        'country' => 'Украина',
        'list' => array(
            'Андрейко',
            'Андрусейко',
            'Барановский',
            'Батейко',
            'Бойко',
            'Бондаренко',
            'Борисенко',
            'Бутко',
            'Вальковский',
            'Вишневецкий',
            'Вознесенский',
            'Выговский',
            'Вяземский',
            'Гамула',
            'Гончар',
            'Городецкий',
            'Драгоманов',
            'Дубченко',
            'Ерёменко',
            'Забужко',
            'Захарченко',
            'Зозуля',
            'Иваненко',
            'Иванив',
            'Иващенко',
            'Кириленко',
            'Кличко',
            'Кобзар',
            'Коваленко',
            'Коваль',
            'Ковальчук',
            'Колесник',
            'Котовский',
            'Коцюбинский',
            'Кравченко',
            'Кравчук',
            'Кулишенко',
            'Лановой',
            'Лукашенко',
            'Марочко',
            'Масловский',
            'Мельник',
            'Милославский',
            'Моисеенко',
            'Мороз',
            'Оболенский',
            'Овчаренко',
            'Олейник',
            'Острожский',
            'Павленко',
            'Пархоменко',
            'Петренко',
            'Петровский',
            'Пилипейко',
            'Полищук',
            'Пономаренко',
            'Рождественский',
            'Романенко',
            'Савенко',
            'Саксаганский',
            'Сасько',
            'Семочко',
            'Симоненко',
            'Сирко',
            'Скляренко',
            'Скоропадский',
            'Сусаренко',
            'Таранец',
            'Тарасюк',
            'Темченко',
            'Терещенко',
            'Тимошенко',
            'Ткаченко',
            'Толочко',
            'Трясило',
            'Федоренко',
            'Хованский',
            'Худобяк',
            'Цушко',
            'Чумак',
            'Шевченко',
            'Шевчук',
            'Шумейко',
            'Яворивский',
        ),
    ),
);

foreach ($surname_array as $country)
{
    $country_name = $country['country'];

    $sql = "SELECT `country_id`
            FROM `country`
            WHERE `country_name`='$country_name'
            LIMIT 1";
    $country_sql = f_igosja_mysqli_query($sql);

    $country_array = $country_sql->fetch_all(1);

    $country_id = $country_array[0]['country_id'];

    foreach ($country['list'] as $item)
    {
        $sql = "SELECT `surname_id`
                FROM `surname`
                WHERE `surname_name`='$item'
                LIMIT 1";
        $surname_sql = f_igosja_mysqli_query($sql);

        if (0 == $surname_sql->num_rows)
        {
            $sql = "INSERT INTO `surname`
                    SET `surname_name`='$item'";
            f_igosja_mysqli_query($sql);

            $surname_id = $mysqli->insert_id;
        }
        else
        {
            $surnam_array = $surname_sql->fetch_all(1);

            $surname_id = $surnam_array[0]['surname_id'];
        }

        $sql = "INSERT INTO `surnamecountry`
                SET `surnamecountry_country_id`=$country_id,
                    `surnamecountry_surname_id`=$surname_id";
        f_igosja_mysqli_query($sql);
    }

    usleep(1);

    print '.';
    flush();
}

$team_array = array(
    array(
        'country' => 'Канада',
        'list' => array(
            array('team' => 'Абботсфорд Хит', 'stadium' => 'Абботсфорд', 'city' => 'Абботсфорд'),
            array('team' => 'Брамптон Бист', 'stadium' => 'Паверад', 'city' => 'Брамптон'),
//            array('team' => 'Ванкувер Кэнакс', 'stadium' => 'Роджерс', 'city' => 'Ванкувер'),
//            array('team' => 'Виннипег Джетс', 'stadium' => 'МТС', 'city' => 'Виннипег'),
//            array('team' => 'Галифакс Мусхэдз', 'stadium' => 'Галифакс Метро', 'city' => 'Галифакс'),
//            array('team' => 'Гамильтон Булдогс', 'stadium' => 'Коппс', 'city' => 'Гамильтон'),
//            array('team' => 'Драммондвилл Вольтижурс', 'stadium' => 'Марсель Дионе', 'city' => 'Драммондвилл'),
//            array('team' => 'Калгари Флэймз', 'stadium' => 'Скоушабэнк-Сэдлдоум', 'city' => 'Калгари'),
//            array('team' => 'Калгари Хитмен', 'stadium' => 'Скоушабэнк-Сэдлдоум', 'city' => 'Калгари'),
//            array('team' => 'Манитоба Мус', 'stadium' => 'МТС', 'city' => 'Виннипег'),
//            array('team' => 'Монреаль Канадиенс', 'stadium' => 'Белл', 'city' => 'Монреаль'),
//            array('team' => 'Оттава Сенаторз', 'stadium' => 'Канадиен Тайер', 'city' => 'Оттава'),
//            array('team' => 'Сент-Джонс АйсКэпс', 'stadium' => 'Майл Уан', 'city' => 'Сент-Джонс'),
//            array('team' => 'Торонто Марлис', 'stadium' => 'Торонто', 'city' => 'Торонто'),
//            array('team' => 'Торонто Мейпл Лифс', 'stadium' => 'Эйр Канада', 'city' => 'Торонто'),
//            array('team' => 'Эдмонтон Ойлерз', 'stadium' => 'Роджерс', 'city' => 'Эдмонтон'),
//            array('team' => 'Гранби Иноук', 'stadium' => 'Леонадр Грондин', 'city' => 'Гранби'),
//            array('team' => 'Драмхеллер Драгонз', 'stadium' => 'Драмхеллер', 'city' => 'Драмхеллер'),
//            array('team' => 'Камлупс Блэйзерс', 'stadium' => 'Интериор Сейвингс', 'city' => 'Камлупс'),
//            array('team' => 'Квебек Ремпартс', 'stadium' => 'Видеотрон', 'city' => 'Квебек'),
//            array('team' => 'Келоуна Рокетс', 'stadium' => 'Проспера', 'city' => 'Келоуна'),
//            array('team' => 'Кутеней Айс', 'stadium' => 'Крэнбрук', 'city' => 'Крэнбрук'),
//            array('team' => 'Летбридж Харрикейнз', 'stadium' => 'ЭНМАКС', 'city' => 'Летбридж'),
//            array('team' => 'Медисин-Хат Тайгерс', 'stadium' => 'Медисин-Хат', 'city' => 'Медисин-Хат'),
//            array('team' => 'Принс-Джордж Кугэрз', 'stadium' => 'СН', 'city' => 'Принс-Джордж'),
//            array('team' => 'Садбери Вулвз', 'stadium' => 'Садбери', 'city' => 'Садбери'),
//            array('team' => 'Саскатун Блейдз', 'stadium' => 'СаскТел', 'city' => 'Саскатун'),
//            array('team' => 'Су-Сент-Мари Грейхаундз', 'stadium' => 'Эссар', 'city' => 'Су-Сент-Мари'),
//            array('team' => 'Фэрвью Флайерз', 'stadium' => 'Фэрвью', 'city' => 'Фэрвью'),
//            array('team' => 'Шелберн Шаркс', 'stadium' => 'Дюферинг', 'city' => 'Шелберн'),
//            array('team' => 'Шербрук Финикс', 'stadium' => 'Пале де Спорт', 'city' => 'Шербрук'),
//            array('team' => 'Эдмонтон Ойл Кингз', 'stadium' => 'Рексал', 'city' => 'Эдмонтон'),
//            array('team' => 'Лаваль Сеинтс', 'stadium' => 'Лаваль', 'city' => 'Лаваль'),
//            array('team' => 'Тербон Кобраз', 'stadium' => 'Тербон', 'city' => 'Тербон'),
        ),
    ),
//    array(
//        'country' => 'США',
//        'list' => array(
//            array('team' => 'Анахайм Дакс', 'stadium' => 'Хонда', 'city' => 'Анахайм'),
//            array('team' => 'Бостон Брюинз', 'stadium' => 'ТД', 'city' => 'Бостон'),
//            array('team' => 'Вашингтон Кэпиталз', 'stadium' => 'Верайзон', 'city' => 'Вашингтон'),
//            array('team' => 'Даллас Старз', 'stadium' => 'Американ Эйрлайнс', 'city' => 'Даллас'),
//            array('team' => 'Детройт Ред Уингз', 'stadium' => 'Джо Луис', 'city' => 'Детройт'),
//            array('team' => 'Лос-Анджелес Кингз', 'stadium' => 'Стэйплс', 'city' => 'Лос-Анджелес'),
//            array('team' => 'Нью-Йорк Айлендерс', 'stadium' => 'Барклайс', 'city' => 'Нью-Йорк'),
//            array('team' => 'Нью-Йорк Рейнджерс', 'stadium' => 'Мэдисон Сквер', 'city' => 'Нью-Йорк'),
//            array('team' => 'Нэшвилл Предаторз', 'stadium' => 'Бриджстоун', 'city' => 'Нэшвилл'),
//            array('team' => 'Питтсбург Пингвинз', 'stadium' => 'Консол Энерджи', 'city' => 'Питтсбург'),
//            array('team' => 'Сан-Хосе Шаркс', 'stadium' => 'SAP', 'city' => 'Сан-Хосе'),
//            array('team' => 'Сент-Луис Блюз', 'stadium' => 'Скоттрэйд', 'city' => 'Сент-Луис'),
//            array('team' => 'Тампа-Бэй Лайтнинг', 'stadium' => 'Амали', 'city' => 'Тампа'),
//            array('team' => 'Филадельфия Флайерз', 'stadium' => 'Веллс-Фарго', 'city' => 'Филадельфия'),
//            array('team' => 'Флорида Пантерз', 'stadium' => 'BB&T', 'city' => 'Санрайз'),
//            array('team' => 'Чикаго Блэкхокс', 'stadium' => 'Юнайтед', 'city' => 'Чикаго'),
//            array('team' => 'Айова Уайлд', 'stadium' => 'Велс Фарго', 'city' => 'Де-Мойн'),
//            array('team' => 'Аризона Койотс', 'stadium' => 'Хила Ривер', 'city' => 'Глендейл'),
//            array('team' => 'Баффало Сейбрз', 'stadium' => 'КиБэнк', 'city' => 'Буффало'),
//            array('team' => 'Бейкерсфилд Кондорс', 'stadium' => 'Робобанк', 'city' => 'Бейкерсфилд'),
//            array('team' => 'Гранд-Рапидс Гриффинс', 'stadium' => 'Ван Андел', 'city' => 'Гранд-Рапидс'),
//            array('team' => 'Каролина Харрикейнз', 'stadium' => 'PNC', 'city' => 'Роли'),
//            array('team' => 'Коламбус Блу Джекетс', 'stadium' => 'Нэшнуайд', 'city' => 'Колумбус'),
//            array('team' => 'Колорадо Эвеланш', 'stadium' => 'Пепси', 'city' => 'Денвер'),
//            array('team' => 'Лейк Эри Монстерз', 'stadium' => 'Куикен Лоанс', 'city' => 'Кливленд'),
//            array('team' => 'Милуоки Эдмиралс', 'stadium' => 'Гарис Бредли', 'city' => 'Милуоки'),
//            array('team' => 'Миннесота Уайлд', 'stadium' => 'Эксел Энерджи', 'city' => 'Сент-Пол'),
//            array('team' => 'Нью-Джерси Девилз', 'stadium' => 'Пруденшал', 'city' => 'Ньюарк'),
//            array('team' => 'Рокфорд Айсхогс', 'stadium' => 'Гарис Банк', 'city' => 'Рокфорд'),
//            array('team' => 'Стоктон Хит', 'stadium' => 'Стоктон', 'city' => 'Стоктон'),
//            array('team' => 'Техас Старз', 'stadium' => 'Седар Парк', 'city' => 'Седар Парк'),
//            array('team' => 'Чикаго Вулвз', 'stadium' => 'Олстейт', 'city' => 'Чикаго'),
//            array('team' => 'Сиракьюз Кранч', 'stadium' => 'Уор Мемориал', 'city' => 'Сиракьюс'),
//            array('team' => 'Ютика Кометс', 'stadium' => 'Ютика Мемориал', 'city' => 'Ютика'),
//        ),
//    ),
//    array(
//        'country' => 'Россия',
//        'list' => array(
//            array('team' => 'Авангард', 'city' => 'Омск', 'stadium' => 'Омск'),
//            array('team' => 'Автомобилист', 'city' => 'Екатеринбург', 'stadium' => 'Уралец'),
//            array('team' => 'Адмирал', 'city' => 'Владивосток', 'stadium' => 'Фетисов'),
//            array('team' => 'Ак Барс', 'city' => 'Казань', 'stadium' => 'Татнефть'),
//            array('team' => 'Динамо', 'city' => 'Москва', 'stadium' => 'Москва'),
//            array('team' => 'Локомотив', 'city' => 'Ярославль', 'stadium' => '2000'),
//            array('team' => 'Металлург', 'city' => 'Магнитогорск', 'stadium' => 'Металлург'),
//            array('team' => 'Нефтехимик', 'city' => 'Нижнекамск', 'stadium' => 'Нефтехимик'),
//            array('team' => 'Салават Юлаев', 'city' => 'Уфа', 'stadium' => 'Уфа'),
//            array('team' => 'Сибирь', 'city' => 'Новосибирск', 'stadium' => 'Сибирь'),
//            array('team' => 'СКА', 'city' => 'Санкт-Петербург', 'stadium' => 'Санкт-Петербург'),
//            array('team' => 'Сочи', 'city' => 'Сочи', 'stadium' => 'Большой'),
//            array('team' => 'Спартак', 'city' => 'Москва', 'stadium' => 'Лужники'),
//            array('team' => 'Торпедо', 'city' => 'Нижний Новгород', 'stadium' => 'Нагорный'),
//            array('team' => 'Трактор', 'city' => 'Челябинск', 'stadium' => 'Трактор'),
//            array('team' => 'ЦСКА', 'city' => 'Москва', 'stadium' => 'ЦСКА'),
//            array('team' => 'Амур', 'city' => 'Хабаровск', 'stadium' => 'Платинум'),
//            array('team' => 'Атлант', 'city' => 'Мытищи', 'stadium' => 'Мытищи'),
//            array('team' => 'Витязь', 'city' => 'Подольск', 'stadium' => 'Витязь'),
//            array('team' => 'Дизель', 'city' => 'Пенза', 'stadium' => 'Дизель'),
//            array('team' => 'Кристалл', 'city' => 'Саратов', 'stadium' => 'Кристалл'),
//            array('team' => 'Кристалл', 'city' => 'Электросталь', 'stadium' => 'Кристалл'),
//            array('team' => 'Крылья Советов', 'city' => 'Москва', 'stadium' => 'Крылья Советов'),
//            array('team' => 'Лада', 'city' => 'Тольятти', 'stadium' => 'Лада'),
//            array('team' => 'МВД', 'city' => 'Балашиха', 'stadium' => 'Балашиха'),
//            array('team' => 'Металлург', 'city' => 'Новокузнецк', 'stadium' => 'Кузнецких металлургов'),
//            array('team' => 'Нефтяник', 'city' => 'Альметьевск', 'stadium' => 'Юбилейный'),
//            array('team' => 'Рубин', 'city' => 'Тюмень', 'stadium' => 'Тюмень'),
//            array('team' => 'Северсталь', 'city' => 'Череповец', 'stadium' => 'Череповец'),
//            array('team' => 'Торос', 'city' => 'Нефтекамск', 'stadium' => 'Нефтекамск'),
//            array('team' => 'Челмет', 'city' => 'Челябинск', 'stadium' => 'Юность'),
//            array('team' => 'Югра', 'city' => 'Ханты-Мансийск', 'stadium' => 'Югра'),
//            array('team' => 'Буран', 'city' => 'Воронеж', 'stadium' => 'Юбилейный'),
//            array('team' => 'Рязань', 'city' => 'Рязань', 'stadium' => 'Олимпийский'),
//        ),
//    ),
//    array(
//        'country' => 'Финляндия',
//        'list' => array(
//            array('team' => 'Ильвес', 'city' => 'Тампере', 'stadium' => 'Тампере'),
//            array('team' => 'Йокерит', 'city' => 'Хельсинки', 'stadium' => 'Хартвалл'),
//            array('team' => 'КалПа', 'city' => 'Куопио', 'stadium' => 'Куопио'),
//            array('team' => 'КооКоо', 'city' => 'Коувола', 'stadium' => 'Лумон'),
//            array('team' => 'Кярпят', 'city' => 'Оулу', 'stadium' => 'Оулу'),
//            array('team' => 'Лукко', 'city' => 'Раума', 'stadium' => 'Аянсуо'),
//            array('team' => 'Пеликанз', 'city' => 'Лахти', 'stadium' => 'Иску'),
//            array('team' => 'СайПа', 'city' => 'Лаппеэнранта', 'stadium' => 'Кисапуисто'),
//            array('team' => 'Таппара', 'city' => 'Тампере', 'stadium' => 'Тампере'),
//            array('team' => 'ТПС', 'city' => 'Турку', 'stadium' => 'Турку'),
//            array('team' => 'ХИФК', 'city' => 'Хельсинки', 'stadium' => 'Хельсинки'),
//            array('team' => 'ХПК', 'city' => 'Хямеэнлинна', 'stadium' => 'Ритари'),
//            array('team' => 'Эспоо Блюз', 'city' => 'Эспоо', 'stadium' => 'Барона'),
//            array('team' => 'Эссят', 'city' => 'Пори', 'stadium' => 'Пори'),
//            array('team' => 'ЮИП', 'city' => 'Ювяскюля', 'stadium' => 'Синергия'),
//            array('team' => 'Юкурит', 'city' => 'Миккели', 'stadium' => 'Калвенкаа'),
//            array('team' => 'Ваасан Спорт', 'city' => 'Вааса', 'stadium' => 'Вааса'),
//            array('team' => 'Д-тим', 'city' => 'Йювяскюля', 'stadium' => 'Хиппос'),
//            array('team' => 'Ийсалмен', 'city' => 'Ийсалми', 'stadium' => 'Канкаан'),
//            array('team' => 'Йокипоят', 'city' => 'Йоэнсуу', 'stadium' => 'Метимаки'),
//            array('team' => 'КеуПа', 'city' => 'Кеуруу', 'stadium' => 'Кеурукун'),
//            array('team' => 'Киекко-Вантаа', 'city' => 'Вантаа', 'stadium' => 'Трио'),
//            array('team' => 'ЛеКи', 'city' => 'Лемпяаля', 'stadium' => 'Маску'),
//            array('team' => 'ОКК', 'city' => 'Хельсинки', 'stadium' => 'Мальмин'),
//            array('team' => 'Пелиитат', 'city' => 'Хейнола', 'stadium' => 'Версовуд'),
//            array('team' => 'РоКи', 'city' => 'Рованиеми', 'stadium' => 'Лаппи'),
//            array('team' => 'СаПКо', 'city' => 'Савонлинна', 'stadium' => 'Гигантти'),
//            array('team' => 'ТуТо', 'city' => 'Турку', 'stadium' => 'Капиттаан'),
//            array('team' => 'Хермес', 'city' => 'Коккола', 'stadium' => 'Кокколан'),
//            array('team' => 'Хокки', 'city' => 'Каяани', 'stadium' => 'Каяаанин'),
//            array('team' => 'Эспоо Юнайтед', 'city' => 'Эспоо', 'stadium' => 'Эспоо'),
//            array('team' => 'ЮИП-Академия', 'city' => 'Ювяскюля', 'stadium' => 'Синергия'),
//            array('team' => 'Кеттера', 'city' => 'Иматра', 'stadium' => 'Вуоксеннискан'),
//            array('team' => 'Хуртат', 'city' => 'Лиекса', 'stadium' => 'Лиекса'),
//        ),
//    ),
//    array(
//        'country' => 'Швеция',
//        'list' => array(
//            array('team' => 'АИК', 'city' => 'Стокгольм', 'stadium' => 'Ховет'),
//            array('team' => 'Брюнес', 'city' => 'Евле', 'stadium' => 'Лэкерол'),
//            array('team' => 'Векшё Лейкерс', 'city' => 'Векшё', 'stadium' => 'Вида'),
//            array('team' => 'Вестерос', 'city' => 'Вестерос', 'stadium' => 'АББ'),
//            array('team' => 'Линчёпинг', 'city' => 'Линчёпинг', 'stadium' => 'Клоетта'),
//            array('team' => 'Лулео', 'city' => 'Лулео', 'stadium' => 'Куп'),
//            array('team' => 'Мальмё Редхоукс', 'city' => 'Мальмё', 'stadium' => 'Мальмё'),
//            array('team' => 'МОДО', 'city' => 'Эрншёльдсвик', 'stadium' => 'Фьелльрэвен'),
//            array('team' => 'Рёгле', 'city' => 'Энгельхольм', 'stadium' => 'Линдап'),
//            array('team' => 'Сёдертелье', 'city' => 'Сёдертелье', 'stadium' => 'AXA Спортс'),
//            array('team' => 'Тимро', 'city' => 'Тимро', 'stadium' => 'Е ОН'),
//            array('team' => 'Ферьестад', 'city' => 'Карлстад', 'stadium' => 'Лёфбергс Лила'),
//            array('team' => 'Фрёлунда', 'city' => 'Гётеборг', 'stadium' => 'Скандинавиум'),
//            array('team' => 'ХВ71', 'city' => 'Йёнчёпинг', 'stadium' => 'Киннарпс'),
//            array('team' => 'Шеллефтео', 'city' => 'Шеллефтео', 'stadium' => 'Шеллефтео Крафт'),
//            array('team' => 'Юргорден', 'city' => 'Стокгольм', 'stadium' => 'Эрикссон-Глоб'),
//            array('team' => 'Альмтуна', 'city' => 'Уппсала', 'stadium' => 'Гранби'),
//            array('team' => 'Бофорс', 'city' => 'Карлскуга', 'stadium' => 'Нобель'),
//            array('team' => 'Бурос', 'city' => 'Бурос', 'stadium' => 'Бурос'),
//            array('team' => 'Каликс', 'city' => 'Каликс', 'stadium' => 'Фуруринкен'),
//            array('team' => 'Карлскруна', 'city' => 'Карлскруна', 'stadium' => 'Карлскруна'),
//            array('team' => 'Кируна', 'city' => 'Кируна', 'stadium' => 'Ломбиа'),
//            array('team' => 'Ковланд', 'city' => 'Ковланд', 'stadium' => 'Ковланд'),
//            array('team' => 'Лександ', 'city' => 'Лександ', 'stadium' => 'Тегера'),
//            array('team' => 'Мура', 'city' => 'Мура', 'stadium' => 'Матссон'),
//            array('team' => 'Оскарсхамн', 'city' => 'Оскарсхамн', 'stadium' => 'Оскарсхамн'),
//            array('team' => 'Сундсвалль', 'city' => 'Сундсвалль', 'stadium' => 'Гердехоф'),
//            array('team' => 'Тингсрюд', 'city' => 'Тингсрюд', 'stadium' => 'Нельсон Гарден'),
//            array('team' => 'Эребру', 'city' => 'Эребру', 'stadium' => 'Берн'),
//            array('team' => 'Эрншёльдсвик', 'city' => 'Эрншёльдсвик', 'stadium' => 'Скиттис'),
//            array('team' => 'Эстерсунд', 'city' => 'Эстерсунд', 'stadium' => 'З'),
//            array('team' => 'Юнгбю', 'city' => 'Юнгбю', 'stadium' => 'Зуннербоховс'),
//            array('team' => 'Веннес', 'city' => 'Веннес', 'stadium' => 'Норра'),
//            array('team' => 'Соллефтео', 'city' => 'Соллефтео', 'stadium' => 'Норра'),
//        ),
//    ),
//    array(
//        'country' => 'Чехия',
//        'list' => array(
//            array('team' => 'Бенатки-над-Йизероу', 'city' => 'Бенатки-над-Йизероу', 'stadium' => 'Бенатки-над-Йизероу'),
//            array('team' => 'Били Тигржи', 'city' => 'Либерец', 'stadium' => 'Типспорт'),
//            array('team' => 'Верва Литвинов', 'city' => 'Литвинов', 'stadium' => 'Иван Глинка'),
//            array('team' => 'Витковице Стил', 'city' => 'Острава', 'stadium' => 'Острава'),
//            array('team' => 'Злин', 'city' => 'Злин', 'stadium' => 'Лудка Кайку'),
//            array('team' => 'Итон Пардубице', 'city' => 'Пардубице', 'stadium' => 'Пардубице'),
//            array('team' => 'Кладно', 'city' => 'Кладно', 'stadium' => 'Зимний стадион'),
//            array('team' => 'Комета', 'city' => 'Брно', 'stadium' => 'Кайот'),
//            array('team' => 'Маунтфилд', 'city' => 'Градец-Кралове', 'stadium' => 'Градец-Кралове'),
//            array('team' => 'Млада Болеслав', 'city' => 'Млада-Болеслав', 'stadium' => 'СКА-Энерго'),
//            array('team' => 'Оломоуц', 'city' => 'Оломоуц', 'stadium' => 'Оломоуц'),
//            array('team' => 'Оцеларжи', 'city' => 'Тршинец', 'stadium' => 'Верк'),
//            array('team' => 'Пльзень', 'city' => 'Пльзень', 'stadium' => 'Пльзень'),
//            array('team' => 'Славия', 'city' => 'Прага', 'stadium' => 'O2'),
//            array('team' => 'Спарта', 'city' => 'Прага', 'stadium' => 'Типспорт'),
//            array('team' => 'Энергия', 'city' => 'Карловы Вары', 'stadium' => 'КВ'),
//            array('team' => 'Бероунски Медведи', 'city' => 'Бероун', 'stadium' => 'Бероун'),
//            array('team' => 'Врхлаби', 'city' => 'Врхлаби', 'stadium' => 'Врхлаби'),
//            array('team' => 'ВСЕС', 'city' => 'Градец-Кралове', 'stadium' => 'Градец'),
//            array('team' => 'Гавиржов Пантрез', 'city' => 'Гавиржов', 'stadium' => 'Гавиржов'),
//            array('team' => 'Гавличкув-Брод', 'city' => 'Гавличкув-Брод', 'stadium' => 'Гавличкув-Брод'),
//            array('team' => 'Дукла', 'city' => 'Йиглава', 'stadium' => 'Йиглава'),
//            array('team' => 'Зноймы Орлы', 'city' => 'Зноймо', 'stadium' => 'Хостан'),
//            array('team' => 'Кадань', 'city' => 'Кадань', 'stadium' => 'Кадань'),
//            array('team' => 'Оломоуц', 'city' => 'Оломоуц', 'stadium' => 'Оломоуц'),
//            array('team' => 'Салис Шумперк', 'city' => 'Шумперк', 'stadium' => 'Шумперк'),
//            array('team' => 'Слезань Опава', 'city' => 'Опава', 'stadium' => 'Опава'),
//            array('team' => 'Табор', 'city' => 'Табор', 'stadium' => 'Табор'),
//            array('team' => 'Устсти Львы', 'city' => 'Усти-над-Лабем', 'stadium' => 'Злотобрамен'),
//            array('team' => 'Хомутов', 'city' => 'Хомутов', 'stadium' => 'Хомутов'),
//            array('team' => 'Хорака Славия', 'city' => 'Тршебич', 'stadium' => 'Тршебич'),
//            array('team' => 'Хрудим', 'city' => 'Хрудим', 'stadium' => 'Хрудим'),
//            array('team' => 'Зубр Пршеров', 'city' => 'Пршеров', 'stadium' => 'Пршеров'),
//            array('team' => 'Техника Брно', 'city' => 'Брно', 'stadium' => 'Брно'),
//        ),
//    ),
//    array(
//        'country' => 'Швейцария',
//        'list' => array(
//            array('team' => 'Ажуа', 'city' => 'Поррантрюи', 'stadium' => 'Поррантрюи'),
//            array('team' => 'Амбри-Пиотта', 'city' => 'Амбри', 'stadium' => 'Писта ла Валаскиа'),
//            array('team' => 'Базель', 'city' => 'Базель', 'stadium' => 'Базель'),
//            array('team' => 'Берн', 'city' => 'Берн', 'stadium' => 'Пост Финанс'),
//            array('team' => 'Биль', 'city' => 'Биль', 'stadium' => 'Биль'),
//            array('team' => 'Давос', 'city' => 'Давос', 'stadium' => 'Вайллант'),
//            array('team' => 'Женева Серветт', 'city' => 'Женева', 'stadium' => 'Вернет'),
//            array('team' => 'Клотен Флайерз', 'city' => 'Клотен', 'stadium' => 'Колпинг'),
//            array('team' => 'Ла-Шо-де-Фон', 'city' => 'Ла-Шо-де-Фон', 'stadium' => 'Мелесез'),
//            array('team' => 'Лангнау Тайгерс', 'city' => 'Лангнау', 'stadium' => 'Ильфис'),
//            array('team' => 'Лозанна', 'city' => 'Лозанна', 'stadium' => 'Маллей'),
//            array('team' => 'Лугано', 'city' => 'Лугано', 'stadium' => 'Песера'),
//            array('team' => 'Рапперсвиль-Йона Лейкерз', 'city' => 'Рапперсвиль-Йона', 'stadium' => 'Динерс Клаб'),
//            array('team' => 'Фрибур Готтерон', 'city' => 'Фрибур', 'stadium' => 'Сен-Леонард'),
//            array('team' => 'Цуг', 'city' => 'Цуг', 'stadium' => 'Боссард'),
//            array('team' => 'Цюрих Лайонс', 'city' => 'Цюрих', 'stadium' => 'Халлен'),
//            array('team' => 'Ароза', 'city' => 'Ароза', 'stadium' => 'Ароза'),
//            array('team' => 'Вилар', 'city' => 'Вилар-Сюр-Оллон', 'stadium' => 'Вилар'),
//            array('team' => 'Вулвз', 'city' => 'Лозанна', 'stadium' => 'Понтейз'),
//            array('team' => 'Кур', 'city' => 'Кур', 'stadium' => 'Кур'),
//            array('team' => 'Лангенталь', 'city' => 'Лангенталь', 'stadium' => 'Шорен'),
//            array('team' => 'Лис', 'city' => 'Лис', 'stadium' => 'Лис'),
//            array('team' => 'Ольтен', 'city' => 'Ольтен', 'stadium' => 'Ольтен'),
//            array('team' => 'Рэд Айс', 'city' => 'Мартиньи', 'stadium' => 'Фором'),
//            array('team' => 'Санкт-Мориц', 'city' => 'Санкт-Мориц', 'stadium' => 'Санкт-Мориц'),
//            array('team' => 'Сиерре Аннивирз', 'city' => 'Сиерре', 'stadium' => 'Сиерре'),
//            array('team' => 'Тайгерз', 'city' => 'Лангнау-им-Эмменталь', 'stadium' => 'Ильфис'),
//            array('team' => 'Тургау', 'city' => 'Вайнфельден', 'stadium' => 'Вайнфельден'),
//            array('team' => 'Фисп', 'city' => 'Фисп', 'stadium' => 'Фисп'),
//            array('team' => 'Форвард Морж', 'city' => 'Морж', 'stadium' => 'Морж'),
//            array('team' => 'Херизау', 'city' => 'Херизау', 'stadium' => 'Херизау'),
//            array('team' => 'Янг Спринтерс', 'city' => 'Невшатель', 'stadium' => 'Жанес Рив'),
//            array('team' => 'Зеевен', 'city' => 'Зеевен', 'stadium' => 'Зеевен'),
//            array('team' => 'Люцерн', 'city' => 'Люцерн', 'stadium' => 'Люцерн'),
//        ),
//    ),
//    array(
//        'country' => 'Словакия',
//        'list' => array(
//            array('team' => '37 Пьештяны', 'city' => 'Истон', 'stadium' => 'Пьештяны'),
//            array('team' => '46 Бардеёв', 'city' => 'Бардеёв', 'stadium' => 'Бардеёв'),
//            array('team' => 'Банска-Бистрица', 'city' => 'Банска-Бистрица', 'stadium' => 'Банска-Бистрица'),
//            array('team' => 'Дукла', 'city' => 'Тренчин', 'stadium' => 'Тренчин'),
//            array('team' => 'Дукла', 'city' => 'Сеница', 'stadium' => 'Сеница'),
//            array('team' => 'Жилина', 'city' => 'Жилина', 'stadium' => 'Жилина'),
//            array('team' => 'Зволен', 'city' => 'Зволен', 'stadium' => 'Зволен'),
//            array('team' => 'Кошице', 'city' => 'Кошице', 'stadium' => 'Стил'),
//            array('team' => 'Липтовски Микулаш', 'city' => 'Липтовски Микулаш', 'stadium' => 'Липтовски Микулаш'),
//            array('team' => 'Мартин', 'city' => 'Мартин', 'stadium' => 'Мартин'),
//            array('team' => 'Нитра', 'city' => 'Нитра', 'stadium' => 'Нитра'),
//            array('team' => 'Оранж 20', 'city' => 'Братислава', 'stadium' => 'Словнафт'),
//            array('team' => 'Попрад', 'city' => 'Попрад', 'stadium' => 'Татравагонка'),
//            array('team' => 'Слован', 'city' => 'Братислава', 'stadium' => 'Словнафт'),
//            array('team' => 'Татранские Волки', 'city' => 'Спишска-Нова-Вес', 'stadium' => 'Спиш'),
//            array('team' => 'ХК-36', 'city' => 'Скалица', 'stadium' => 'Макс'),
//            array('team' => '07 Детва', 'city' => 'Детва', 'stadium' => 'Детва'),
//            array('team' => '07 Прешов', 'city' => 'Прешов', 'stadium' => 'Прешов'),
//            array('team' => '91 Сеница', 'city' => 'Сеница', 'stadium' => 'Сеница'),
//            array('team' => '95 Поважска-Бистрица', 'city' => 'Поважска-Бистрица', 'stadium' => 'Поважска-Бистрица'),
//            array('team' => 'Брезно', 'city' => 'Брезно', 'stadium' => 'Брезно'),
//            array('team' => 'Гуменне', 'city' => 'Гуменне', 'stadium' => 'Гуменне'),
//            array('team' => 'Дольни-Кубин', 'city' => 'Дольни-Кубин', 'stadium' => 'Дольни-Кубин'),
//            array('team' => 'Дукла', 'city' => 'Михаловце', 'stadium' => 'Михаловце'),
//            array('team' => 'Кежмарок', 'city' => 'Кежмарок', 'stadium' => 'Кежмарок'),
//            array('team' => 'Прешов Пингвинз', 'city' => 'Прешов', 'stadium' => 'Прешов'),
//            array('team' => 'Прьевидза', 'city' => 'Прьевидза', 'stadium' => 'Прьевидза'),
//            array('team' => 'Ружинов', 'city' => 'Братислава', 'stadium' => 'Владимир Дзурилла'),
//            array('team' => 'Слован', 'city' => 'Гелница', 'stadium' => 'Гелница'),
//            array('team' => 'Топольчани', 'city' => 'Топольчани', 'stadium' => 'Топольчани'),
//            array('team' => 'Требишов', 'city' => 'Требишов', 'stadium' => 'Требишов'),
//            array('team' => 'Трнава', 'city' => 'Трнава', 'stadium' => 'Трнава'),
//            array('team' => 'Злате-Моравце', 'city' => 'Злате-Моравце', 'stadium' => 'Злате-Моравце'),
//            array('team' => 'Пухов', 'city' => 'Пухов', 'stadium' => 'Пухов'),
//        ),
//    ),
//    array(
//        'country' => 'Белоруссия',
//        'list' => array(
//            array('team' => 'Брест', 'city' => 'Брест', 'stadium' => 'Брест'),
//            array('team' => 'Витебск', 'city' => 'Витебск', 'stadium' => 'Витебск'),
//            array('team' => 'Газпромнефть', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Гомель', 'city' => 'Гомель', 'stadium' => 'Гомель'),
//            array('team' => 'Динамо', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Динамо', 'city' => 'Молодечно', 'stadium' => 'Молодечно'),
//            array('team' => 'Динамо-Шинник', 'city' => 'Бобруйск', 'stadium' => 'Бобруйск'),
//            array('team' => 'Лида', 'city' => 'Лида', 'stadium' => 'Лида'),
//            array('team' => 'Металлург', 'city' => 'Жлобин', 'stadium' => 'Металлург'),
//            array('team' => 'Могилёв', 'city' => 'Могилёв', 'stadium' => 'Могилёв'),
//            array('team' => 'Неман', 'city' => 'Гродно', 'stadium' => 'Гродно'),
//            array('team' => 'Тивали', 'city' => 'Минск', 'stadium' => 'Юность'),
//            array('team' => 'Химик-СКА', 'city' => 'Новополоцк', 'stadium' => 'Полимир'),
//            array('team' => 'Шахтер', 'city' => 'Солигорск', 'stadium' => 'Солигорск'),
//            array('team' => 'Юниор', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Юность', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Авангард', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Аматар', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Атлант', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Драконы', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Ледовые львы', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Микст', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Миф', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Молнии', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Регион', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Рубеж', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Рубон', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Сокол', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Столица', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Строитель', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Феникс', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Характер', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Беркут', 'city' => 'Минск', 'stadium' => 'Минск'),
//            array('team' => 'Бизоны', 'city' => 'Минск', 'stadium' => 'Минск'),
//        ),
//    ),
//    array(
//        'country' => 'Германия',
//        'list' => array(
//            array('team' => 'Адлер Мангейм', 'city' => 'Мангейм', 'stadium' => 'САП'),
//            array('team' => 'Айсберен Берлин', 'city' => 'Берлин', 'stadium' => 'Мерседес-Бенц'),
//            array('team' => 'Аугсбургер Пантер', 'city' => 'Аугсбург', 'stadium' => 'Курт-Френцель'),
//            array('team' => 'Бад-Наухайм', 'city' => 'Бад-Наухайм', 'stadium' => 'Бад-Наухайм'),
//            array('team' => 'Гамбург Фризерс', 'city' => 'Гамбург', 'stadium' => 'Барклейкард'),
//            array('team' => 'Ганновер Скорпионс', 'city' => 'Ганновер', 'stadium' => 'Туй'),
//            array('team' => 'Гриззлис Вольфсбург', 'city' => 'Вольфсбург', 'stadium' => 'Вольфсбург'),
//            array('team' => 'Дюссельдорф', 'city' => 'Дюссельдорф', 'stadium' => 'ИСС дом'),
//            array('team' => 'Изерлон Рустерс', 'city' => 'Изерлон', 'stadium' => 'Изерлон'),
//            array('team' => 'Ингольштадт', 'city' => 'Ингольштадт', 'stadium' => 'Сатурн'),
//            array('team' => 'Кассель Хаскис', 'city' => 'Кассель', 'stadium' => 'Кассель'),
//            array('team' => 'Кёльнер Хайе', 'city' => 'Кёльн', 'stadium' => 'Ланксесс'),
//            array('team' => 'Крефельд Пингвин', 'city' => 'Крефельд', 'stadium' => 'Кёнигспаласт'),
//            array('team' => 'Нюрнберг Айс Тайгерс', 'city' => 'Нюрнберг', 'stadium' => 'Нюрнберг'),
//            array('team' => 'Ред Булл', 'city' => 'Мюнхен', 'stadium' => 'Олимпия'),
//            array('team' => 'Фиштаун Пингвинз', 'city' => 'Бремерхафен', 'stadium' => 'Ледовая арена'),
//            array('team' => 'Байройт', 'city' => 'Байройт', 'stadium' => 'Байройт'),
//            array('team' => 'Битигхайм Стилерз', 'city' => 'Битигхайм-Биссинген', 'stadium' => 'Эгтранс'),
//            array('team' => 'Дрезден Айслёвен', 'city' => 'Дрезден', 'stadium' => 'Эненрджи Вербунд'),
//            array('team' => 'Дуйсбург Фухсе', 'city' => 'Дуйсбург', 'stadium' => 'Сканиа'),
//            array('team' => 'Кауфбойрен', 'city' => 'Кауфбойрен', 'stadium' => 'Спаркассен'),
//            array('team' => 'Криммичау', 'city' => 'Криммичау', 'stadium' => 'Санпарк'),
//            array('team' => 'Лауситзер Фухсе', 'city' => 'Вайсвассер', 'stadium' => 'Вайсвассер'),
//            array('team' => 'Равенсбург Тауэрстарз', 'city' => 'Равенсбург', 'stadium' => 'Равенсбург'),
//            array('team' => 'Ризерси', 'city' => 'Гармиш-Партенкирхен', 'stadium' => 'Олимпия'),
//            array('team' => 'Роте Тойфель', 'city' => 'Бад-Наухайм', 'stadium' => 'Колонел'),
//            array('team' => 'Старбулз Розенхайм', 'city' => 'Розенхайм', 'stadium' => 'Катрейн'),
//            array('team' => 'Фрайбург', 'city' => 'Фрайбург-им-Брайсгау', 'stadium' => 'Франц-Сигель'),
//            array('team' => 'Франкфурт Лайонс', 'city' => 'Франкфурт-на-Майне', 'stadium' => 'Франкфурт'),
//            array('team' => 'Хайльбронн Фалькен', 'city' => 'Хайльбронн', 'stadium' => 'Кольбеншмидт'),
//            array('team' => 'Швеннингер Уайлд Уингз', 'city' => 'Филлинген-Швеннинген', 'stadium' => 'Гелиос'),
//            array('team' => 'Штраубинг Тайгерс', 'city' => 'Штраубинг', 'stadium' => 'Пульвертурм'),
//            array('team' => 'Ганновер Индианз', 'city' => 'Ганновер', 'stadium' => 'Фердетурм'),
//            array('team' => 'Эссен Москитс', 'city' => 'Эссен', 'stadium' => 'Эссен'),
//        ),
//    ),
//    array(
//        'country' => 'Норвегия',
//        'list' => array(
//            array('team' => 'Берген', 'city' => 'Берген', 'stadium' => 'Берген'),
//            array('team' => 'Волеренга', 'city' => 'Осло', 'stadium' => 'Юрдаль Амфи'),
//            array('team' => 'Йёвик', 'city' => 'Йёвик', 'stadium' => 'Йёвик'),
//            array('team' => 'Комет', 'city' => 'Халден', 'stadium' => 'Халден'),
//            array('team' => 'Конгсвингер Кнайтс', 'city' => 'Конгсвингер', 'stadium' => 'Конгсвингер'),
//            array('team' => 'Лёренскуг', 'city' => 'Лёренскуг', 'stadium' => 'Лёренскуг'),
//            array('team' => 'Лиллехаммер', 'city' => 'Лиллехаммер', 'stadium' => 'Кристинс'),
//            array('team' => 'Манглеруд Стар', 'city' => 'Осло', 'stadium' => 'Манглеруд'),
//            array('team' => 'Русенборг', 'city' => 'Тронхейм', 'stadium' => 'Лиген'),
//            array('team' => 'Спарта Уорриорз', 'city' => 'Сарпсборг', 'stadium' => 'Спарта'),
//            array('team' => 'Ставангер Ойлерз', 'city' => 'Ставангер', 'stadium' => 'ДНБ'),
//            array('team' => 'Сторхамар', 'city' => 'Хамар', 'stadium' => 'Хамар'),
//            array('team' => 'Стьернен', 'city' => 'Фредрикстад', 'stadium' => 'Стьернен'),
//            array('team' => 'Тёнсберг Викингс', 'city' => 'Тёнсберг', 'stadium' => 'Тёнсберг'),
//            array('team' => 'Фриск Аскер', 'city' => 'Аскер', 'stadium' => 'Аскер'),
//            array('team' => 'Фурусет', 'city' => 'Осло', 'stadium' => 'Фурусет'),
//            array('team' => 'Грюнер', 'city' => 'Осло', 'stadium' => 'Грюнер'),
//            array('team' => 'Кристиансанн', 'city' => 'Кристиансанн', 'stadium' => 'Кристиансанн'),
//            array('team' => 'Лидерхорн Гладиаторз', 'city' => 'Берген', 'stadium' => 'Берген'),
//            array('team' => 'Локомотив Фана', 'city' => 'Берген', 'stadium' => 'Берген'),
//            array('team' => 'Мосс', 'city' => 'Мосс', 'stadium' => 'Мосс'),
//            array('team' => 'Нарвик', 'city' => 'Нарвик', 'stadium' => 'Нордкрафт'),
//            array('team' => 'Нидарос', 'city' => 'Тронхейм', 'stadium' => 'Лиген'),
//            array('team' => 'Принсдален Вилз', 'city' => 'Осло', 'stadium' => 'Грюнер'),
//            array('team' => 'Рингерике Пантерз', 'city' => 'Хёнефосс', 'stadium' => 'Шёнг'),
//            array('team' => 'Тёнсберг', 'city' => 'Тёнсберг', 'stadium' => 'Тёнсберг'),
//            array('team' => 'Тромсё', 'city' => 'Тромсё', 'stadium' => 'Тромсё'),
//            array('team' => 'Хасле-Лёрен', 'city' => 'Осло', 'stadium' => 'Лёрен'),
//            array('team' => 'Хёугесунн Сигалс', 'city' => 'Хёугесунн', 'stadium' => 'Хёугесунн'),
//            array('team' => 'Шедсму', 'city' => 'Шедсму', 'stadium' => 'Шедсму'),
//            array('team' => 'Ши Айсхоукс', 'city' => 'Ши', 'stadium' => 'Ши'),
//            array('team' => 'Ютул', 'city' => 'Берум', 'stadium' => 'Берум'),
//            array('team' => 'Драммен Ривер Ретс', 'city' => 'Драммен', 'stadium' => 'Драммен'),
//            array('team' => 'Яар', 'city' => 'Берум', 'stadium' => 'Берум'),
//        ),
//    ),
//    array(
//        'country' => 'Украина',
//        'list' => array(
//            array('team' => 'Белый Барс', 'city' => 'Белая Церковь', 'stadium' => 'Белая Церковь'),
//            array('team' => 'Будивельник', 'city' => 'Киев', 'stadium' => 'Киев'),
//            array('team' => 'Винницкие Гайдамаки', 'city' => 'Винница', 'stadium' => 'Ледовый Клуб'),
//            array('team' => 'Витязь', 'city' => 'Харьков', 'stadium' => 'Салтовский лёд'),
//            array('team' => 'Дженералз', 'city' => 'Киев', 'stadium' => 'Киев'),
//            array('team' => 'Динамо', 'city' => 'Харьков', 'stadium' => 'Салтовский лёд'),
//            array('team' => 'Донбасс', 'city' => 'Донецк', 'stadium' => 'Дружба'),
//            array('team' => 'Дружба-78', 'city' => 'Харьков', 'stadium' => 'Харьков'),
//            array('team' => 'Компаньон', 'city' => 'Киев', 'stadium' => 'АТЕК'),
//            array('team' => 'Кременчуг', 'city' => 'Кременчуг', 'stadium' => 'Айсберг'),
//            array('team' => 'Кривбасс', 'city' => 'Кривой Рог', 'stadium' => 'Кривой Рог'),
//            array('team' => 'Львы', 'city' => 'Львов', 'stadium' => 'Новояворовск'),
//            array('team' => 'Молодая гвардия', 'city' => 'Донецк', 'stadium' => 'Дружба'),
//            array('team' => 'Партиот', 'city' => 'Винница', 'stadium' => 'Винница'),
//            array('team' => 'Подол', 'city' => 'Киев', 'stadium' => 'АТЕК'),
//            array('team' => 'Сокол', 'city' => 'Киев', 'stadium' => 'Терминал'),
//            array('team' => 'АТЕК', 'city' => 'Киев', 'stadium' => 'АТЕК'),
//            array('team' => 'Вороны', 'city' => 'Сумы', 'stadium' => 'Сумы'),
//            array('team' => 'Гладиатор', 'city' => 'Львов', 'stadium' => 'Медик'),
//            array('team' => 'Днепр', 'city' => 'Херсон', 'stadium' => 'Фаворит'),
//            array('team' => 'Луцк', 'city' => 'Луцк', 'stadium' => 'Луцк'),
//            array('team' => 'Льдинка', 'city' => 'Киев', 'stadium' => 'Льдинка'),
//            array('team' => 'Одесса', 'city' => 'Одесса', 'stadium' => 'Умка'),
//            array('team' => 'Олимпия', 'city' => 'Калуш', 'stadium' => 'Калуш'),
//            array('team' => 'Политехник', 'city' => 'Киев', 'stadium' => 'Авангард'),
//            array('team' => 'Рапид', 'city' => 'Киев', 'stadium' => 'Киев'),
//            array('team' => 'Фаворит', 'city' => 'Ровно', 'stadium' => 'Ровно'),
//            array('team' => 'Цунами', 'city' => 'Ивано-Франковск', 'stadium' => 'Ивано-Франковск'),
//            array('team' => 'Экспресс', 'city' => 'Львов', 'stadium' => 'Медик'),
//            array('team' => 'Эней', 'city' => 'Дрогобич', 'stadium' => 'Дрогобич'),
//            array('team' => 'Юность', 'city' => 'Харьков', 'stadium' => 'Салтовский лёд'),
//            array('team' => 'Явор', 'city' => 'Явоворов', 'stadium' => 'Явоворов'),
//            array('team' => 'Ведмеди', 'city' => 'Ужгород', 'stadium' => 'Ужгород'),
//            array('team' => 'Подоляны', 'city' => 'Тернополь', 'stadium' => 'Тернополь'),
//        ),
//    ),
);

foreach ($team_array as $country)
{
    $country_name = $country['country'];

    $sql = "SELECT `country_id`
            FROM `country`
            WHERE `country_name`='$country_name'
            LIMIT 1";
    $country_sql = f_igosja_mysqli_query($sql);

    $country_array = $country_sql->fetch_all(1);

    $country_id = $country_array[0]['country_id'];

    foreach ($country['list'] as $item)
    {
        $city_name = $item['city'];

        $sql = "INSERT INTO `city`
                SET `city_country_id`=$country_id,
                    `city_name`='$city_name'";
        f_igosja_mysqli_query($sql);

        $city_id = $mysqli->insert_id;

        $stadium_name = $item['stadium'];

        $sql = "INSERT INTO `stadium`
                SET `stadium_city_id`=$city_id,
                    `stadium_name`='$stadium_name'";
        f_igosja_mysqli_query($sql);

        $stadium_id = $mysqli->insert_id;

        $team_name = $item['team'];

        $sql = "INSERT INTO `team`
                SET `team_stadium_id`=$stadium_id,
                    `team_name`='$team_name'";
        f_igosja_mysqli_query($sql);

        $team_id = $mysqli->insert_id;

        $log = array(
            'history_historytext_id' => HISTORYTEXT_TEAM_REGISTER,
            'history_team_id' => $team_id,
        );
        f_igosja_history($log);
        f_igosja_create_team_players($team_id);

        $sql = "SELECT SUM(`player_power_nominal`) AS `power`
                FROM `player`
                LEFT JOIN `playerposition`
                ON `player_id`=`playerposition_player_id`
                WHERE `player_team_id`=$team_id
                AND `playerposition_position_id`!=" . POSITION_GK . "
                ORDER BY `player_power_nominal` DESC, `player_id` ASC
                LIMIT 15";
        $power_sql = f_igosja_mysqli_query($sql);

        $power_array = $power_sql->fetch_all(1);

        $power = $power_array[0]['power'];

        $sql = "SELECT SUM(`player_power_nominal`) AS `power`
                FROM `player`
                LEFT JOIN `playerposition`
                ON `player_id`=`playerposition_player_id`
                WHERE `player_team_id`=$team_id
                AND `playerposition_position_id`=" . POSITION_GK . "
                ORDER BY `player_power_nominal` DESC, `player_id` ASC
                LIMIT 1";
        $power_sql = f_igosja_mysqli_query($sql);

        $power_array = $power_sql->fetch_all(1);

        $power_c_16 = $power + $power_array[0]['power'];

        $sql = "SELECT SUM(`player_power_nominal`) AS `power`
                FROM `player`
                LEFT JOIN `playerposition`
                ON `player_id`=`playerposition_player_id`
                WHERE `player_team_id`=$team_id
                AND `playerposition_position_id`!=" . POSITION_GK . "
                ORDER BY `player_power_nominal` DESC, `player_id` ASC
                LIMIT 20";
        $power_sql = f_igosja_mysqli_query($sql);

        $power_array = $power_sql->fetch_all(1);

        $power = $power_array[0]['power'];

        $sql = "SELECT SUM(`player_power_nominal`) AS `power`
                FROM `player`
                LEFT JOIN `playerposition`
                ON `player_id`=`playerposition_player_id`
                WHERE `player_team_id`=$team_id
                AND `playerposition_position_id`=" . POSITION_GK . "
                ORDER BY `player_power_nominal` DESC, `player_id` ASC
                LIMIT 1";
        $power_sql = f_igosja_mysqli_query($sql);

        $power_array = $power_sql->fetch_all(1);

        $power_c_21 = $power + $power_array[0]['power'];

        $sql = "SELECT SUM(`player_power_nominal`) AS `power`
                FROM `player`
                LEFT JOIN `playerposition`
                ON `player_id`=`playerposition_player_id`
                WHERE `player_team_id`=$team_id
                AND `playerposition_position_id`!=" . POSITION_GK . "
                ORDER BY `player_power_nominal` DESC, `player_id` ASC
                LIMIT 25";
        $power_sql = f_igosja_mysqli_query($sql);

        $power_array = $power_sql->fetch_all(1);

        $power = $power_array[0]['power'];

        $sql = "SELECT SUM(`player_power_nominal`) AS `power`
                FROM `player`
                LEFT JOIN `playerposition`
                ON `player_id`=`playerposition_player_id`
                WHERE `player_team_id`=$team_id
                AND `playerposition_position_id`=" . POSITION_GK . "
                ORDER BY `player_power_nominal` DESC, `player_id` ASC
                LIMIT 2";
        $power_sql = f_igosja_mysqli_query($sql);

        $power_array = $power_sql->fetch_all(1);

        $power_c_27 = $power + $power_array[0]['power'];

        $sql = "SELECT SUM(`player_power_nominal`) AS `power`
                FROM `player`
                LEFT JOIN `playerposition`
                ON `player_id`=`playerposition_player_id`
                WHERE `player_team_id`=$team_id
                AND `playerposition_position_id`!=" . POSITION_GK . "
                ORDER BY `player_power_nominal` DESC, `player_id` ASC
                LIMIT 15";
        $power_sql = f_igosja_mysqli_query($sql);

        $power_array = $power_sql->fetch_all(1);

        $power = $power_array[0]['power'];

        $sql = "SELECT SUM(`player_power_nominal_s`) AS `power`
                FROM `player`
                LEFT JOIN `playerposition`
                ON `player_id`=`playerposition_player_id`
                WHERE `player_team_id`=$team_id
                AND `playerposition_position_id`=" . POSITION_GK . "
                ORDER BY `player_power_nominal` DESC, `player_id` ASC
                LIMIT 1";
        $power_sql = f_igosja_mysqli_query($sql);

        $power_array = $power_sql->fetch_all(1);

        $power_s_16 = $power + $power_array[0]['power'];

        $sql = "SELECT SUM(`player_power_nominal_s`) AS `power`
                FROM `player`
                LEFT JOIN `playerposition`
                ON `player_id`=`playerposition_player_id`
                WHERE `player_team_id`=$team_id
                AND `playerposition_position_id`!=" . POSITION_GK . "
                ORDER BY `player_power_nominal` DESC, `player_id` ASC
                LIMIT 20";
        $power_sql = f_igosja_mysqli_query($sql);

        $power_array = $power_sql->fetch_all(1);

        $power = $power_array[0]['power'];

        $sql = "SELECT SUM(`player_power_nominal_s`) AS `power`
                FROM `player`
                LEFT JOIN `playerposition`
                ON `player_id`=`playerposition_player_id`
                WHERE `player_team_id`=$team_id
                AND `playerposition_position_id`=" . POSITION_GK . "
                ORDER BY `player_power_nominal` DESC, `player_id` ASC
                LIMIT 1";
        $power_sql = f_igosja_mysqli_query($sql);

        $power_array = $power_sql->fetch_all(1);

        $power_s_21 = $power + $power_array[0]['power'];

        $sql = "SELECT SUM(`player_power_nominal_s`) AS `power`
                FROM `player`
                LEFT JOIN `playerposition`
                ON `player_id`=`playerposition_player_id`
                WHERE `player_team_id`=$team_id
                AND `playerposition_position_id`!=" . POSITION_GK . "
                ORDER BY `player_power_nominal` DESC, `player_id` ASC
                LIMIT 25";
        $power_sql = f_igosja_mysqli_query($sql);

        $power_array = $power_sql->fetch_all(1);

        $power = $power_array[0]['power'];

        $sql = "SELECT SUM(`player_power_nominal_s`) AS `power`
                FROM `player`
                LEFT JOIN `playerposition`
                ON `player_id`=`playerposition_player_id`
                WHERE `player_team_id`=$team_id
                AND `playerposition_position_id`=" . POSITION_GK . "
                ORDER BY `player_power_nominal` DESC, `player_id` ASC
                LIMIT 2";
        $power_sql = f_igosja_mysqli_query($sql);

        $power_array = $power_sql->fetch_all(1);

        $power_s_27 = $power + $power_array[0]['power'];

        $power_v    = round(($power_c_16 + $power_c_21 + $power_c_27) / 64 * 16);
        $power_vs   = round(($power_s_16 + $power_s_21 + $power_s_27) / 64 * 16);

        $sql = "UPDATE `team`
                SET `team_power_c_16`=$power_c_16,
                    `team_power_c_21`=$power_c_21,
                    `team_power_c_27`=$power_c_27,
                    `team_power_s_16`=$power_s_16,
                    `team_power_s_21`=$power_s_21,
                    `team_power_s_27`=$power_s_27,
                    `team_power_v`=$power_v,
                    `team_power_vs`=$power_vs
                WHERE `team_id`=$team_id
                LIMIT 1";
        f_igosja_mysqli_query($sql);

        usleep(1);

        print '.';
        flush();
    }
}

//Начало формирования календаря
$shedule_insert_array       = array();
$shedule_friendly_array     = array(6, 13, 20, 27, 34, 41, 48, 55, 61, 62);
$shedule_offseason_array    = array(0, 1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12);
$shedule_stage_array        = array(
     2,  3,  4,  5,  6,  7, 1,
     8,  9, 10, 11, 12, 13, 1,
     2,  3,  4,  5,  6,  7, 1,
     8,  9, 10, 11, 12, 13, 1,
    14, 15, 16, 17, 18, 19, 1,
    20, 21, 22, 23, 24, 25, 1,
    26, 27, 28, 29, 30, 31, 1,
    54, 54, 54, 55, 55, 55, 1,
    56, 56, 56, 56, 56,  1, 1
);
$shedule_conference_stage_array = array(
     2,  3,  4,  5,  6,  7, 1,
     8,  9, 10, 11, 12, 13, 1,
     2,  3,  4,  5,  6,  7, 1,
     8,  9, 10, 11, 12, 13, 1,
    14, 15, 16, 17, 18, 19, 1,
    20, 21, 22, 23, 24, 25, 1,
    26, 27, 28, 29, 30, 31, 1,
    32, 33, 34, 35, 36, 37, 1,
    38, 39, 40, 41, 42,  1, 1
);

$start_date = strtotime('Mon') + 12 * 60 * 60;
$start_date = time();

for ($i=0; $i<63; $i++)
{
    $date       = $start_date + $i * 24 * 60 *60;
    $conference = 0;

    if (in_array($i, $shedule_friendly_array))
    {
        $tournament_type = TOURNAMENTTYPE_FRIENDLY;
    }
    elseif (in_array($i, $shedule_offseason_array))
    {
        $tournament_type = TOURNAMENTTYPE_OFFSEASON;
    }
    else
    {
        $conference         = 1;
        $tournament_type    = TOURNAMENTTYPE_CHAMPIONSHIP;
    }

    $shedule_insert_array[] = "('$date', 1, '$shedule_stage_array[$i]', '$tournament_type')";

    if ($conference)
    {
        $tournament_type_c  = TOURNAMENTTYPE_CONFERENCE;
        $shedule_insert_array[] = "('$date', 1, '$shedule_conference_stage_array[$i]', '$tournament_type_c')";
    }
}

$shedule_insert_array = implode(',', $shedule_insert_array);

$sql = "INSERT INTO `shedule` (`shedule_date`, `shedule_season_id`, `shedule_stage_id`, `shedule_tournamenttype_id`)
        VALUES $shedule_insert_array;";
f_igosja_mysqli_query($sql);
//Конец формирования календаря

//Начало формирования таблицы и матчей кубка межсезонья
$game_array = array();

$sql = "INSERT INTO `offseason` (`offseason_season_id`, `offseason_team_id`)
        SELECT '$igosja_season_id', `team_id`
        FROM `team`
        WHERE `team_id`!=0
        ORDER BY `team_id` ASC";
f_igosja_mysqli_query($sql);

$sql = "SELECT `shedule_id`
        FROM `shedule`
        WHERE `shedule_tournamenttype_id`=" . TOURNAMENTTYPE_OFFSEASON . "
        AND `shedule_stage_id`=" . STAGE_1_TOUR . "
        AND `shedule_season_id`=$igosja_season_id
        LIMIT 1";
$shedule_sql = f_igosja_mysqli_query($sql);

$shedule_array = $shedule_sql->fetch_all(1);

$shedule_id = $shedule_array[0]['shedule_id'];

$sql = "SELECT `offseason_team_id`,
               `stadium_id`
        FROM `offseason`
        LEFT JOIN `team`
        ON `offseason_team_id`=`team_id`
        LEFT JOIN `stadium`
        ON `team_stadium_id`=`stadium_id`
        WHERE `offseason_season_id`=$igosja_season_id
        ORDER BY RAND()";
$team_sql = f_igosja_mysqli_query($sql);

$count_team = $team_sql->num_rows;
$team_array = $team_sql->fetch_all(1);

for ($i=0; $i<$count_team; $i=$i+2)
{
    $team_1_id      = $team_array[$i]['offseason_team_id'];
    $team_2_id      = $team_array[$i+1]['offseason_team_id'];
    $stadium_id     = $team_array[$i]['stadium_id'];
    $game_array[]   = "('$team_1_id', '$team_2_id', '$shedule_id', '$stadium_id')";
}

$game_array = implode(', ', $game_array);

$sql = "INSERT INTO `game` (`game_guest_team_id`, `game_home_team_id`, `game_shedule_id`, `game_stadium_id`)
        VALUES $game_array;";
f_igosja_mysqli_query($sql);
//Конец формирования таблицы и матчей кубка межсезонья

//Начало формирования таблиц и матчей чемпионата
$championship_country_array = array();

$sql = "SELECT `city_country_id`
        FROM `team`
        LEFT JOIN `stadium`
        ON `team_stadium_id`=`stadium_id`
        LEFT JOIN `city`
        ON `stadium_city_id`=`city_id`
        WHERE `team_id`!=0
        GROUP BY `city_country_id`
        HAVING COUNT(`team_id`)>=16
        ORDER BY `city_country_id` ASC";
$country_sql = f_igosja_mysqli_query($sql);

$country_array = $country_sql->fetch_all(1);

foreach ($country_array as $country)
{
    $country_id = $country['city_country_id'];

    $championship_country_array[] = $country_id;

    $sql = "INSERT INTO `championship` (`championship_country_id`, `championship_division_id`, `championship_season_id`, `championship_team_id`)
            SELECT `city_country_id`, 1, '$igosja_season_id', `team_id`
            FROM `team`
            LEFT JOIN `stadium`
            ON `team_stadium_id`=`stadium_id`
            LEFT JOIN `city`
            ON `stadium_city_id`=`city_id`
            WHERE `team_id`!=0
            AND `city_country_id`=$country_id
            ORDER BY `team_id` ASC
            LIMIT 16";
    f_igosja_mysqli_query($sql);

    $sql = "INSERT INTO `championship` (`championship_country_id`, `championship_division_id`, `championship_season_id`, `championship_team_id`)
            SELECT `city_country_id`, 2, $igosja_season_id, `team_id`
            FROM `team`
            LEFT JOIN `stadium`
            ON `team_stadium_id`=`stadium_id`
            LEFT JOIN `city`
            ON `stadium_city_id`=`city_id`
            WHERE `team_id`!=0
            AND `city_country_id`=$country_id
            ORDER BY `team_id` ASC
            LIMIT 16, 16";
    f_igosja_mysqli_query($sql);
}

$sql = "SELECT `shedule_id`
        FROM `shedule`
        WHERE `shedule_season_id`=$igosja_season_id
        AND `shedule_tournamenttype_id`=" . TOURNAMENTTYPE_CHAMPIONSHIP . "
        ORDER BY `shedule_id` ASC
        LIMIT 30";
$shedule_sql = f_igosja_mysqli_query($sql);

$shedule_array = $shedule_sql->fetch_all(1);

$shedule_id_01 = $shedule_array[0]['shedule_id'];
$shedule_id_02 = $shedule_array[1]['shedule_id'];
$shedule_id_03 = $shedule_array[2]['shedule_id'];
$shedule_id_04 = $shedule_array[3]['shedule_id'];
$shedule_id_05 = $shedule_array[4]['shedule_id'];
$shedule_id_06 = $shedule_array[5]['shedule_id'];
$shedule_id_07 = $shedule_array[6]['shedule_id'];
$shedule_id_08 = $shedule_array[7]['shedule_id'];
$shedule_id_09 = $shedule_array[8]['shedule_id'];
$shedule_id_10 = $shedule_array[9]['shedule_id'];
$shedule_id_11 = $shedule_array[10]['shedule_id'];
$shedule_id_12 = $shedule_array[11]['shedule_id'];
$shedule_id_13 = $shedule_array[12]['shedule_id'];
$shedule_id_14 = $shedule_array[13]['shedule_id'];
$shedule_id_15 = $shedule_array[14]['shedule_id'];
$shedule_id_16 = $shedule_array[15]['shedule_id'];
$shedule_id_17 = $shedule_array[16]['shedule_id'];
$shedule_id_18 = $shedule_array[17]['shedule_id'];
$shedule_id_19 = $shedule_array[18]['shedule_id'];
$shedule_id_20 = $shedule_array[19]['shedule_id'];
$shedule_id_21 = $shedule_array[20]['shedule_id'];
$shedule_id_22 = $shedule_array[21]['shedule_id'];
$shedule_id_23 = $shedule_array[22]['shedule_id'];
$shedule_id_24 = $shedule_array[23]['shedule_id'];
$shedule_id_25 = $shedule_array[24]['shedule_id'];
$shedule_id_26 = $shedule_array[25]['shedule_id'];
$shedule_id_27 = $shedule_array[26]['shedule_id'];
$shedule_id_28 = $shedule_array[27]['shedule_id'];
$shedule_id_29 = $shedule_array[28]['shedule_id'];
$shedule_id_30 = $shedule_array[29]['shedule_id'];

foreach ($championship_country_array as $item)
{
    for ($i=1; $i<=2; $i++)
    {
        $sql = "SELECT `championship_team_id`,
                       `stadium_id`
                FROM `championship`
                LEFT JOIN `team`
                ON `championship_team_id`=`team_id`
                LEFT JOIN `stadium`
                ON `team_stadium_id`=`stadium_id`
                WHERE `championship_country_id`=$item
                AND `championship_division_id`=$i
                AND `championship_season_id`=$igosja_season_id
                ORDER BY RAND()";
        $team_sql = f_igosja_mysqli_query($sql);

        $team_array = $team_sql->fetch_all(1);

        $team_id_01 = $team_array[0]['championship_team_id'];
        $team_id_02 = $team_array[1]['championship_team_id'];
        $team_id_03 = $team_array[2]['championship_team_id'];
        $team_id_04 = $team_array[3]['championship_team_id'];
        $team_id_05 = $team_array[4]['championship_team_id'];
        $team_id_06 = $team_array[5]['championship_team_id'];
        $team_id_07 = $team_array[6]['championship_team_id'];
        $team_id_08 = $team_array[7]['championship_team_id'];
        $team_id_09 = $team_array[8]['championship_team_id'];
        $team_id_10 = $team_array[9]['championship_team_id'];
        $team_id_11 = $team_array[10]['championship_team_id'];
        $team_id_12 = $team_array[11]['championship_team_id'];
        $team_id_13 = $team_array[12]['championship_team_id'];
        $team_id_14 = $team_array[13]['championship_team_id'];
        $team_id_15 = $team_array[14]['championship_team_id'];
        $team_id_16 = $team_array[15]['championship_team_id'];

        $stadium_id_01 = $team_array[0]['stadium_id'];
        $stadium_id_02 = $team_array[1]['stadium_id'];
        $stadium_id_03 = $team_array[2]['stadium_id'];
        $stadium_id_04 = $team_array[3]['stadium_id'];
        $stadium_id_05 = $team_array[4]['stadium_id'];
        $stadium_id_06 = $team_array[5]['stadium_id'];
        $stadium_id_07 = $team_array[6]['stadium_id'];
        $stadium_id_08 = $team_array[7]['stadium_id'];
        $stadium_id_09 = $team_array[8]['stadium_id'];
        $stadium_id_10 = $team_array[9]['stadium_id'];
        $stadium_id_11 = $team_array[10]['stadium_id'];
        $stadium_id_12 = $team_array[11]['stadium_id'];
        $stadium_id_13 = $team_array[12]['stadium_id'];
        $stadium_id_14 = $team_array[13]['stadium_id'];
        $stadium_id_15 = $team_array[14]['stadium_id'];
        $stadium_id_16 = $team_array[15]['stadium_id'];

        $sql = "INSERT INTO `game` (`game_home_team_id`, `game_guest_team_id`, `game_shedule_id`, `game_stadium_id`)
                VALUES ('$team_id_02', '$team_id_01', '$shedule_id_01', '$stadium_id_02'),
                       ('$team_id_03', '$team_id_15', '$shedule_id_01', '$stadium_id_03'),
                       ('$team_id_04', '$team_id_14', '$shedule_id_01', '$stadium_id_04'),
                       ('$team_id_05', '$team_id_13', '$shedule_id_01', '$stadium_id_05'),
                       ('$team_id_06', '$team_id_12', '$shedule_id_01', '$stadium_id_06'),
                       ('$team_id_07', '$team_id_11', '$shedule_id_01', '$stadium_id_07'),
                       ('$team_id_08', '$team_id_10', '$shedule_id_01', '$stadium_id_08'),
                       ('$team_id_16', '$team_id_09', '$shedule_id_01', '$stadium_id_16'),
                       ('$team_id_01', '$team_id_03', '$shedule_id_02', '$stadium_id_01'),
                       ('$team_id_02', '$team_id_16', '$shedule_id_02', '$stadium_id_02'),
                       ('$team_id_10', '$team_id_09', '$shedule_id_02', '$stadium_id_10'),
                       ('$team_id_11', '$team_id_08', '$shedule_id_02', '$stadium_id_11'),
                       ('$team_id_12', '$team_id_07', '$shedule_id_02', '$stadium_id_12'),
                       ('$team_id_13', '$team_id_06', '$shedule_id_02', '$stadium_id_13'),
                       ('$team_id_14', '$team_id_05', '$shedule_id_02', '$stadium_id_14'),
                       ('$team_id_15', '$team_id_04', '$shedule_id_02', '$stadium_id_15'),
                       ('$team_id_03', '$team_id_02', '$shedule_id_03', '$stadium_id_03'),
                       ('$team_id_04', '$team_id_01', '$shedule_id_03', '$stadium_id_04'),
                       ('$team_id_05', '$team_id_15', '$shedule_id_03', '$stadium_id_05'),
                       ('$team_id_06', '$team_id_14', '$shedule_id_03', '$stadium_id_06'),
                       ('$team_id_07', '$team_id_13', '$shedule_id_03', '$stadium_id_07'),
                       ('$team_id_08', '$team_id_12', '$shedule_id_03', '$stadium_id_08'),
                       ('$team_id_09', '$team_id_11', '$shedule_id_03', '$stadium_id_09'),
                       ('$team_id_16', '$team_id_10', '$shedule_id_03', '$stadium_id_16'),
                       ('$team_id_01', '$team_id_05', '$shedule_id_04', '$stadium_id_01'),
                       ('$team_id_02', '$team_id_04', '$shedule_id_04', '$stadium_id_02'),
                       ('$team_id_03', '$team_id_16', '$shedule_id_04', '$stadium_id_03'),
                       ('$team_id_11', '$team_id_10', '$shedule_id_04', '$stadium_id_11'),
                       ('$team_id_12', '$team_id_09', '$shedule_id_04', '$stadium_id_12'),
                       ('$team_id_13', '$team_id_08', '$shedule_id_04', '$stadium_id_13'),
                       ('$team_id_14', '$team_id_07', '$shedule_id_04', '$stadium_id_14'),
                       ('$team_id_15', '$team_id_06', '$shedule_id_04', '$stadium_id_15'),
                       ('$team_id_04', '$team_id_03', '$shedule_id_05', '$stadium_id_04'),
                       ('$team_id_05', '$team_id_02', '$shedule_id_05', '$stadium_id_05'),
                       ('$team_id_06', '$team_id_01', '$shedule_id_05', '$stadium_id_06'),
                       ('$team_id_07', '$team_id_15', '$shedule_id_05', '$stadium_id_07'),
                       ('$team_id_08', '$team_id_14', '$shedule_id_05', '$stadium_id_08'),
                       ('$team_id_09', '$team_id_13', '$shedule_id_05', '$stadium_id_09'),
                       ('$team_id_10', '$team_id_12', '$shedule_id_05', '$stadium_id_10'),
                       ('$team_id_16', '$team_id_11', '$shedule_id_05', '$stadium_id_16'),
                       ('$team_id_01', '$team_id_07', '$shedule_id_06', '$stadium_id_01'),
                       ('$team_id_02', '$team_id_06', '$shedule_id_06', '$stadium_id_02'),
                       ('$team_id_03', '$team_id_05', '$shedule_id_06', '$stadium_id_03'),
                       ('$team_id_04', '$team_id_16', '$shedule_id_06', '$stadium_id_04'),
                       ('$team_id_12', '$team_id_11', '$shedule_id_06', '$stadium_id_12'),
                       ('$team_id_13', '$team_id_10', '$shedule_id_06', '$stadium_id_13'),
                       ('$team_id_14', '$team_id_09', '$shedule_id_06', '$stadium_id_14'),
                       ('$team_id_15', '$team_id_08', '$shedule_id_06', '$stadium_id_15'),
                       ('$team_id_05', '$team_id_04', '$shedule_id_07', '$stadium_id_05'),
                       ('$team_id_06', '$team_id_03', '$shedule_id_07', '$stadium_id_06'),
                       ('$team_id_07', '$team_id_02', '$shedule_id_07', '$stadium_id_07'),
                       ('$team_id_08', '$team_id_01', '$shedule_id_07', '$stadium_id_08'),
                       ('$team_id_09', '$team_id_15', '$shedule_id_07', '$stadium_id_09'),
                       ('$team_id_10', '$team_id_14', '$shedule_id_07', '$stadium_id_10'),
                       ('$team_id_11', '$team_id_13', '$shedule_id_07', '$stadium_id_11'),
                       ('$team_id_16', '$team_id_12', '$shedule_id_07', '$stadium_id_16'),
                       ('$team_id_01', '$team_id_09', '$shedule_id_08', '$stadium_id_01'),
                       ('$team_id_02', '$team_id_08', '$shedule_id_08', '$stadium_id_02'),
                       ('$team_id_03', '$team_id_07', '$shedule_id_08', '$stadium_id_03'),
                       ('$team_id_04', '$team_id_06', '$shedule_id_08', '$stadium_id_04'),
                       ('$team_id_05', '$team_id_16', '$shedule_id_08', '$stadium_id_05'),
                       ('$team_id_13', '$team_id_12', '$shedule_id_08', '$stadium_id_13'),
                       ('$team_id_14', '$team_id_11', '$shedule_id_08', '$stadium_id_14'),
                       ('$team_id_15', '$team_id_10', '$shedule_id_08', '$stadium_id_15'),
                       ('$team_id_06', '$team_id_05', '$shedule_id_09', '$stadium_id_06'),
                       ('$team_id_07', '$team_id_04', '$shedule_id_09', '$stadium_id_07'),
                       ('$team_id_08', '$team_id_03', '$shedule_id_09', '$stadium_id_08'),
                       ('$team_id_09', '$team_id_02', '$shedule_id_09', '$stadium_id_09'),
                       ('$team_id_10', '$team_id_01', '$shedule_id_09', '$stadium_id_10'),
                       ('$team_id_11', '$team_id_15', '$shedule_id_09', '$stadium_id_11'),
                       ('$team_id_12', '$team_id_14', '$shedule_id_09', '$stadium_id_12'),
                       ('$team_id_16', '$team_id_13', '$shedule_id_09', '$stadium_id_16'),
                       ('$team_id_01', '$team_id_11', '$shedule_id_10', '$stadium_id_01'),
                       ('$team_id_02', '$team_id_10', '$shedule_id_10', '$stadium_id_02'),
                       ('$team_id_03', '$team_id_09', '$shedule_id_10', '$stadium_id_03'),
                       ('$team_id_04', '$team_id_08', '$shedule_id_10', '$stadium_id_04'),
                       ('$team_id_05', '$team_id_07', '$shedule_id_10', '$stadium_id_05'),
                       ('$team_id_06', '$team_id_16', '$shedule_id_10', '$stadium_id_06'),
                       ('$team_id_14', '$team_id_13', '$shedule_id_10', '$stadium_id_14'),
                       ('$team_id_15', '$team_id_12', '$shedule_id_10', '$stadium_id_15'),
                       ('$team_id_07', '$team_id_06', '$shedule_id_11', '$stadium_id_07'),
                       ('$team_id_08', '$team_id_05', '$shedule_id_11', '$stadium_id_08'),
                       ('$team_id_09', '$team_id_04', '$shedule_id_11', '$stadium_id_09'),
                       ('$team_id_10', '$team_id_03', '$shedule_id_11', '$stadium_id_10'),
                       ('$team_id_11', '$team_id_02', '$shedule_id_11', '$stadium_id_11'),
                       ('$team_id_12', '$team_id_01', '$shedule_id_11', '$stadium_id_12'),
                       ('$team_id_13', '$team_id_15', '$shedule_id_11', '$stadium_id_13'),
                       ('$team_id_16', '$team_id_14', '$shedule_id_11', '$stadium_id_16'),
                       ('$team_id_01', '$team_id_13', '$shedule_id_12', '$stadium_id_01'),
                       ('$team_id_02', '$team_id_12', '$shedule_id_12', '$stadium_id_02'),
                       ('$team_id_03', '$team_id_11', '$shedule_id_12', '$stadium_id_03'),
                       ('$team_id_04', '$team_id_10', '$shedule_id_12', '$stadium_id_04'),
                       ('$team_id_05', '$team_id_09', '$shedule_id_12', '$stadium_id_05'),
                       ('$team_id_06', '$team_id_08', '$shedule_id_12', '$stadium_id_06'),
                       ('$team_id_07', '$team_id_16', '$shedule_id_12', '$stadium_id_07'),
                       ('$team_id_15', '$team_id_14', '$shedule_id_12', '$stadium_id_15'),
                       ('$team_id_08', '$team_id_07', '$shedule_id_13', '$stadium_id_08'),
                       ('$team_id_09', '$team_id_06', '$shedule_id_13', '$stadium_id_09'),
                       ('$team_id_10', '$team_id_05', '$shedule_id_13', '$stadium_id_10'),
                       ('$team_id_11', '$team_id_04', '$shedule_id_13', '$stadium_id_11'),
                       ('$team_id_12', '$team_id_03', '$shedule_id_13', '$stadium_id_12'),
                       ('$team_id_13', '$team_id_02', '$shedule_id_13', '$stadium_id_13'),
                       ('$team_id_14', '$team_id_01', '$shedule_id_13', '$stadium_id_14'),
                       ('$team_id_16', '$team_id_15', '$shedule_id_13', '$stadium_id_16'),
                       ('$team_id_01', '$team_id_15', '$shedule_id_14', '$stadium_id_01'),
                       ('$team_id_02', '$team_id_14', '$shedule_id_14', '$stadium_id_02'),
                       ('$team_id_03', '$team_id_13', '$shedule_id_14', '$stadium_id_03'),
                       ('$team_id_04', '$team_id_12', '$shedule_id_14', '$stadium_id_04'),
                       ('$team_id_05', '$team_id_11', '$shedule_id_14', '$stadium_id_05'),
                       ('$team_id_06', '$team_id_10', '$shedule_id_14', '$stadium_id_06'),
                       ('$team_id_07', '$team_id_09', '$shedule_id_14', '$stadium_id_07'),
                       ('$team_id_16', '$team_id_08', '$shedule_id_14', '$stadium_id_16'),
                       ('$team_id_09', '$team_id_08', '$shedule_id_15', '$stadium_id_09'),
                       ('$team_id_10', '$team_id_07', '$shedule_id_15', '$stadium_id_10'),
                       ('$team_id_11', '$team_id_06', '$shedule_id_15', '$stadium_id_11'),
                       ('$team_id_12', '$team_id_05', '$shedule_id_15', '$stadium_id_12'),
                       ('$team_id_13', '$team_id_04', '$shedule_id_15', '$stadium_id_13'),
                       ('$team_id_14', '$team_id_03', '$shedule_id_15', '$stadium_id_14'),
                       ('$team_id_15', '$team_id_02', '$shedule_id_15', '$stadium_id_15'),
                       ('$team_id_16', '$team_id_01', '$shedule_id_15', '$stadium_id_16'),
                       ('$team_id_01', '$team_id_02', '$shedule_id_16', '$stadium_id_01'),
                       ('$team_id_15', '$team_id_03', '$shedule_id_16', '$stadium_id_15'),
                       ('$team_id_14', '$team_id_04', '$shedule_id_16', '$stadium_id_14'),
                       ('$team_id_13', '$team_id_05', '$shedule_id_16', '$stadium_id_13'),
                       ('$team_id_12', '$team_id_06', '$shedule_id_16', '$stadium_id_12'),
                       ('$team_id_11', '$team_id_07', '$shedule_id_16', '$stadium_id_11'),
                       ('$team_id_10', '$team_id_08', '$shedule_id_16', '$stadium_id_10'),
                       ('$team_id_09', '$team_id_16', '$shedule_id_16', '$stadium_id_09'),
                       ('$team_id_03', '$team_id_01', '$shedule_id_17', '$stadium_id_03'),
                       ('$team_id_16', '$team_id_02', '$shedule_id_17', '$stadium_id_16'),
                       ('$team_id_09', '$team_id_10', '$shedule_id_17', '$stadium_id_09'),
                       ('$team_id_08', '$team_id_11', '$shedule_id_17', '$stadium_id_08'),
                       ('$team_id_07', '$team_id_12', '$shedule_id_17', '$stadium_id_07'),
                       ('$team_id_06', '$team_id_13', '$shedule_id_17', '$stadium_id_06'),
                       ('$team_id_05', '$team_id_14', '$shedule_id_17', '$stadium_id_05'),
                       ('$team_id_04', '$team_id_15', '$shedule_id_17', '$stadium_id_04'),
                       ('$team_id_02', '$team_id_03', '$shedule_id_18', '$stadium_id_02'),
                       ('$team_id_01', '$team_id_04', '$shedule_id_18', '$stadium_id_01'),
                       ('$team_id_15', '$team_id_05', '$shedule_id_18', '$stadium_id_15'),
                       ('$team_id_14', '$team_id_06', '$shedule_id_18', '$stadium_id_14'),
                       ('$team_id_13', '$team_id_07', '$shedule_id_18', '$stadium_id_13'),
                       ('$team_id_12', '$team_id_08', '$shedule_id_18', '$stadium_id_12'),
                       ('$team_id_11', '$team_id_09', '$shedule_id_18', '$stadium_id_11'),
                       ('$team_id_10', '$team_id_16', '$shedule_id_18', '$stadium_id_10'),
                       ('$team_id_05', '$team_id_01', '$shedule_id_19', '$stadium_id_05'),
                       ('$team_id_04', '$team_id_02', '$shedule_id_19', '$stadium_id_04'),
                       ('$team_id_16', '$team_id_03', '$shedule_id_19', '$stadium_id_16'),
                       ('$team_id_10', '$team_id_11', '$shedule_id_19', '$stadium_id_10'),
                       ('$team_id_09', '$team_id_12', '$shedule_id_19', '$stadium_id_09'),
                       ('$team_id_08', '$team_id_13', '$shedule_id_19', '$stadium_id_08'),
                       ('$team_id_07', '$team_id_14', '$shedule_id_19', '$stadium_id_07'),
                       ('$team_id_06', '$team_id_15', '$shedule_id_19', '$stadium_id_06'),
                       ('$team_id_03', '$team_id_04', '$shedule_id_20', '$stadium_id_03'),
                       ('$team_id_02', '$team_id_05', '$shedule_id_20', '$stadium_id_02'),
                       ('$team_id_01', '$team_id_06', '$shedule_id_20', '$stadium_id_01'),
                       ('$team_id_15', '$team_id_07', '$shedule_id_20', '$stadium_id_15'),
                       ('$team_id_14', '$team_id_08', '$shedule_id_20', '$stadium_id_14'),
                       ('$team_id_13', '$team_id_09', '$shedule_id_20', '$stadium_id_13'),
                       ('$team_id_12', '$team_id_10', '$shedule_id_20', '$stadium_id_12'),
                       ('$team_id_11', '$team_id_16', '$shedule_id_20', '$stadium_id_11'),
                       ('$team_id_07', '$team_id_01', '$shedule_id_21', '$stadium_id_07'),
                       ('$team_id_06', '$team_id_02', '$shedule_id_21', '$stadium_id_06'),
                       ('$team_id_05', '$team_id_03', '$shedule_id_21', '$stadium_id_05'),
                       ('$team_id_16', '$team_id_04', '$shedule_id_21', '$stadium_id_16'),
                       ('$team_id_11', '$team_id_12', '$shedule_id_21', '$stadium_id_11'),
                       ('$team_id_10', '$team_id_13', '$shedule_id_21', '$stadium_id_10'),
                       ('$team_id_09', '$team_id_14', '$shedule_id_21', '$stadium_id_09'),
                       ('$team_id_08', '$team_id_15', '$shedule_id_21', '$stadium_id_08'),
                       ('$team_id_04', '$team_id_05', '$shedule_id_22', '$stadium_id_04'),
                       ('$team_id_03', '$team_id_06', '$shedule_id_22', '$stadium_id_03'),
                       ('$team_id_02', '$team_id_07', '$shedule_id_22', '$stadium_id_02'),
                       ('$team_id_01', '$team_id_08', '$shedule_id_22', '$stadium_id_01'),
                       ('$team_id_15', '$team_id_09', '$shedule_id_22', '$stadium_id_15'),
                       ('$team_id_14', '$team_id_10', '$shedule_id_22', '$stadium_id_14'),
                       ('$team_id_13', '$team_id_11', '$shedule_id_22', '$stadium_id_13'),
                       ('$team_id_12', '$team_id_16', '$shedule_id_22', '$stadium_id_12'),
                       ('$team_id_09', '$team_id_01', '$shedule_id_23', '$stadium_id_09'),
                       ('$team_id_08', '$team_id_02', '$shedule_id_23', '$stadium_id_08'),
                       ('$team_id_07', '$team_id_03', '$shedule_id_23', '$stadium_id_07'),
                       ('$team_id_06', '$team_id_04', '$shedule_id_23', '$stadium_id_06'),
                       ('$team_id_16', '$team_id_05', '$shedule_id_23', '$stadium_id_16'),
                       ('$team_id_12', '$team_id_13', '$shedule_id_23', '$stadium_id_12'),
                       ('$team_id_11', '$team_id_14', '$shedule_id_23', '$stadium_id_11'),
                       ('$team_id_10', '$team_id_15', '$shedule_id_23', '$stadium_id_10'),
                       ('$team_id_05', '$team_id_06', '$shedule_id_24', '$stadium_id_05'),
                       ('$team_id_04', '$team_id_07', '$shedule_id_24', '$stadium_id_04'),
                       ('$team_id_03', '$team_id_08', '$shedule_id_24', '$stadium_id_03'),
                       ('$team_id_02', '$team_id_09', '$shedule_id_24', '$stadium_id_02'),
                       ('$team_id_01', '$team_id_10', '$shedule_id_24', '$stadium_id_01'),
                       ('$team_id_15', '$team_id_11', '$shedule_id_24', '$stadium_id_15'),
                       ('$team_id_14', '$team_id_12', '$shedule_id_24', '$stadium_id_14'),
                       ('$team_id_13', '$team_id_16', '$shedule_id_24', '$stadium_id_13'),
                       ('$team_id_11', '$team_id_01', '$shedule_id_25', '$stadium_id_11'),
                       ('$team_id_10', '$team_id_02', '$shedule_id_25', '$stadium_id_10'),
                       ('$team_id_09', '$team_id_03', '$shedule_id_25', '$stadium_id_09'),
                       ('$team_id_08', '$team_id_04', '$shedule_id_25', '$stadium_id_08'),
                       ('$team_id_07', '$team_id_05', '$shedule_id_25', '$stadium_id_07'),
                       ('$team_id_16', '$team_id_06', '$shedule_id_25', '$stadium_id_16'),
                       ('$team_id_13', '$team_id_14', '$shedule_id_25', '$stadium_id_13'),
                       ('$team_id_12', '$team_id_15', '$shedule_id_25', '$stadium_id_12'),
                       ('$team_id_06', '$team_id_07', '$shedule_id_26', '$stadium_id_06'),
                       ('$team_id_05', '$team_id_08', '$shedule_id_26', '$stadium_id_05'),
                       ('$team_id_04', '$team_id_09', '$shedule_id_26', '$stadium_id_04'),
                       ('$team_id_03', '$team_id_10', '$shedule_id_26', '$stadium_id_03'),
                       ('$team_id_02', '$team_id_11', '$shedule_id_26', '$stadium_id_02'),
                       ('$team_id_01', '$team_id_12', '$shedule_id_26', '$stadium_id_01'),
                       ('$team_id_15', '$team_id_13', '$shedule_id_26', '$stadium_id_15'),
                       ('$team_id_14', '$team_id_16', '$shedule_id_26', '$stadium_id_14'),
                       ('$team_id_13', '$team_id_01', '$shedule_id_27', '$stadium_id_13'),
                       ('$team_id_12', '$team_id_02', '$shedule_id_27', '$stadium_id_12'),
                       ('$team_id_11', '$team_id_03', '$shedule_id_27', '$stadium_id_11'),
                       ('$team_id_10', '$team_id_04', '$shedule_id_27', '$stadium_id_10'),
                       ('$team_id_09', '$team_id_05', '$shedule_id_27', '$stadium_id_09'),
                       ('$team_id_08', '$team_id_06', '$shedule_id_27', '$stadium_id_08'),
                       ('$team_id_16', '$team_id_07', '$shedule_id_27', '$stadium_id_16'),
                       ('$team_id_14', '$team_id_15', '$shedule_id_27', '$stadium_id_14'),
                       ('$team_id_07', '$team_id_08', '$shedule_id_28', '$stadium_id_07'),
                       ('$team_id_06', '$team_id_09', '$shedule_id_28', '$stadium_id_06'),
                       ('$team_id_05', '$team_id_10', '$shedule_id_28', '$stadium_id_05'),
                       ('$team_id_04', '$team_id_11', '$shedule_id_28', '$stadium_id_04'),
                       ('$team_id_03', '$team_id_12', '$shedule_id_28', '$stadium_id_03'),
                       ('$team_id_02', '$team_id_13', '$shedule_id_28', '$stadium_id_02'),
                       ('$team_id_01', '$team_id_14', '$shedule_id_28', '$stadium_id_01'),
                       ('$team_id_15', '$team_id_16', '$shedule_id_28', '$stadium_id_15'),
                       ('$team_id_15', '$team_id_01', '$shedule_id_29', '$stadium_id_15'),
                       ('$team_id_14', '$team_id_02', '$shedule_id_29', '$stadium_id_14'),
                       ('$team_id_13', '$team_id_03', '$shedule_id_29', '$stadium_id_13'),
                       ('$team_id_12', '$team_id_04', '$shedule_id_29', '$stadium_id_12'),
                       ('$team_id_11', '$team_id_05', '$shedule_id_29', '$stadium_id_11'),
                       ('$team_id_10', '$team_id_06', '$shedule_id_29', '$stadium_id_10'),
                       ('$team_id_09', '$team_id_07', '$shedule_id_29', '$stadium_id_09'),
                       ('$team_id_08', '$team_id_16', '$shedule_id_29', '$stadium_id_08'),
                       ('$team_id_08', '$team_id_09', '$shedule_id_30', '$stadium_id_08'),
                       ('$team_id_07', '$team_id_10', '$shedule_id_30', '$stadium_id_07'),
                       ('$team_id_06', '$team_id_11', '$shedule_id_30', '$stadium_id_06'),
                       ('$team_id_05', '$team_id_12', '$shedule_id_30', '$stadium_id_05'),
                       ('$team_id_04', '$team_id_13', '$shedule_id_30', '$stadium_id_04'),
                       ('$team_id_03', '$team_id_14', '$shedule_id_30', '$stadium_id_03'),
                       ('$team_id_02', '$team_id_15', '$shedule_id_30', '$stadium_id_02'),
                       ('$team_id_01', '$team_id_16', '$shedule_id_30', '$stadium_id_01');";
            f_igosja_mysqli_query($sql);
    }
}
//Конец формирования таблиц и матчей чемпионата

//Начало формирования таблицы и матчей конференции
$game_array = array();

$sql = "INSERT INTO `conference` (`conference_season_id`, `conference_team_id`)
        SELECT '$igosja_season_id', `team_id`
        FROM `team`
        WHERE `team_id`!=0
        AND `team_id` NOT IN
        (
            SELECT `championship_team_id`
            FROM `championship`
            WHERE `championship_season_id`=$igosja_season_id
        )
        ORDER BY `team_id` ASC";
f_igosja_mysqli_query($sql);

$sql = "SELECT `shedule_id`
        FROM `shedule`
        WHERE `shedule_tournamenttype_id`=" . TOURNAMENTTYPE_CONFERENCE . "
        AND `shedule_stage_id`=" . STAGE_1_TOUR . "
        AND `shedule_season_id`=$igosja_season_id
        LIMIT 1";
$shedule_sql = f_igosja_mysqli_query($sql);

$shedule_array = $shedule_sql->fetch_all(1);

$shedule_id = $shedule_array[0]['shedule_id'];

$sql = "SELECT `conference_team_id`,
               `stadium_id`
        FROM `conference`
        LEFT JOIN `team`
        ON `conference_team_id`=`team_id`
        LEFT JOIN `stadium`
        ON `team_stadium_id`=`stadium_id`
        WHERE `conference_season_id`=$igosja_season_id
        ORDER BY RAND()";
$team_sql = f_igosja_mysqli_query($sql);

$count_team = $team_sql->num_rows;
$team_array = $team_sql->fetch_all(1);

for ($i=0; $i<$count_team; $i=$i+2)
{
    $team_1_id      = $team_array[$i]['conference_team_id'];
    $team_2_id      = $team_array[$i+1]['conference_team_id'];
    $stadium_id     = $team_array[$i]['stadium_id'];
    $game_array[]   = "('$team_1_id', '$team_2_id', '$shedule_id', '$stadium_id')";
}

$game_array = implode(', ', $game_array);

$sql = "INSERT INTO `game` (`game_guest_team_id`, `game_home_team_id`, `game_shedule_id`, `game_stadium_id`)
        VALUES $game_array;";
f_igosja_mysqli_query($sql);
//Конец формирования таблицы и матчей конференции

print '<br/><a href="/admin/index.php">Ready</a>';