<div class="row">
    <div class="col-lg-12 col-md-12 col-sm-12 col-xs-12">
        <р>Запрещены любые провокации в адрес собеседников, способные вызвать негативную ответную реакцию.</р>
        <р>Совсем отдаленное от темы содержание (оффтопик).</р>
        <р>Запрещены грубые по тону сообщения, нецензурные выражения и оскорбления в любой форме.</р>
        <р>Запрещены сообщения на любом языке, кроме русского (используя русский алфавит).</р>
        <р>Запрещено написание заведомо ложной информации, клеветы, неподтвержденной доказательствами информации, которая может нанести вред чьей-либо репутации.</р>
        <р>Запрещены призывы к нарушению правил игры, форума и законодательства.</р>
        <р>Запрещаются нечестные приемы ведения дискуссий в виде "передергиваний" высказываний собеседников, правки своих собственных сообщений с целью исказить их первоначальный смысл.</р>
        <р>Запрещены "наезды" на личности, на группы личностей, угрозы физической расправы и т.д.</р>
        <р>Бессмысленная или малосодержательная информация, которая не несёт смысловой нагрузки (флуд).</р>
        <р>Запрещено чрезмерное количество грамматических ошибок, жаргонных слов, современных сетевых "диалектов".</р>
        <р>Запрещены сообщения содержащие более половины ЗАГЛАВНЫХ БУКВ.</р>
        <р>Запрещены оскорбления болельщиков реальных команд в виде различных прозвищ.</р>
        <р>Запрещены сокращения и намёки на распространенные нецензурные и оскорбительные выражения, такие как "ХЗ", "ПНХ" и т.д.</р>
        <р>Запрещены мотивы националистического или расистского характера, а также сообщения, дискриминирующие кого-либо по возрастному, половому, религиозному признакам или по социальному статусу.</р>
        <р>Запрещены подколы в адрес новичков и других персонажей Лиги, которые могут быть неправильно поняты.</р>
        <р>Запрещено настойчивое навязывание своего отрицательного мнения по поводу модераторов, администраторов или Лиги в целом.</р>
    </div>
</div>
