<?php

return [
    'password-html' => 'Ви запросили відновлення пароля на сайті Віртуальної Хокейної Ліги.
        <br>
        Щоб відновити пароль перейдіть за посиланням {link}.',
    'password-text' => 'Ви запросили відновлення пароля на сайті Віртуальної Хокейної Ліги.
        Щоб відновити пароль перейдіть за посиланням {link}.',
    'signUp-html' => 'Ви успішно зареєстровані на сайті Віртуальної Хокейної Ліги під логіном <strong>{login}</strong>.
        <br/>
        Щоб завершити реєстрацію підтвердіть свій email за посиланням {link}
        або введіть код <strong>{code}</strong> на сторінці {page}',
    'signUp-text' => 'Ви успішно зареєстровані на сайті Віртуальної Хокейної Ліги під логіном {login}.
        Щоб завершити реєстрацію підтвердіть свій email за посиланням {link} або введіть код {code} на сторінці {page}',
];
