<?php

return [
    'h1' => 'Активація облікового запису',
    'link-repeat' => 'Мені не прийшов лист',
    'submit' => 'Активувати обліковий запис',
    'text' => '<p>
            <strong>Активувати свій обліковий запис</strong> - це означае підтвердити,
            що вказана при реєстрації поштова скринька належить вам і працює.<br/>
            Тільки після цього ви зможете повністю користуватися функціями сайту.
        </p>
        <p>
            Для активації облікового запису вам потрібно ввести код активації,
            який був відправлений вам на електронну пошту.
        </p>',
];
