<?php

return [
    'h1' => 'Забули пароль?',
    'submit' => 'Відновити пароль',
    'text-1' => '<p>
            Тут ви можете запросити надсилання <strong>загубленого пароля на свою поштову скриньку</strong>,
            котра була вказан вами при реєстрації.
        </p>
        <p>
            Вкажіть ваш <strong>логін</strong> або <strong>email</strong>:
        </p>',
    'text-2' => '<p>
            Якщо при реєстрації ви ввели свій email невірно або він вже не працює,
            <br/>
            напишіть нам лист на <span class="strong">' . Yii::$app->params['infoEmail'] . '</span>
            <br/>
            і ми спопробуємо знайти ваш обліковий запис вручную.
        </p>',
];
