<?php

return [
    'h1' => 'Реєстрація в грі',
    'submit' => 'Почати кар\'єру менеджера',
    'text-1' => '<p>
            Ваша <strong>кар\'єра тренера-менеджера</strong>
            в Віртуальній Хокейній Лізі починається прямо тут і зараз.<br/>
            Для того, щоб ми могли відрізнити вас від інших гравців, придумайте собі
            <Strong>логін</strong> та <strong>пароль</strong>:
        </p>',
    'text-2' => '<p>
            На <strong>ваш e-mail</strong> відправиться код активації облікового запису.
            Потім туди можна вислати пароль, якщо ви його забудете:
        </p>',
    'text-3' => '<p>
            Починаючи кар\'єру менеджера, ви приймаєте угоду про користування сайтом.
        </p>
        <p>
            Зверніть увагу, у нас заборонено грати одночасно під кількома ніками.
        </p>',
];
