<?php

return [
    'password-html' => 'Вы запросили восстановление пароля на сайте Виртуальной Хоккейной Лиги.
        <br>
        Чтобы восстановить пароль перейдите по ссылке {link}.',
    'password-text' => 'Вы запросили восстановление пароля на сайте Виртуальной Хоккейной Лиги.
        Чтобы восстановить пароль перейдите по ссылке {link}.',
    'signUp-html' => 'Вы успешно зарегистрированы на сайте Виртуальной Хоккейной Лиги под логином
        <strong>{login}</strong>.
        <br/>
        Чтобы завершить регистрацию подтвердите свой email по ссылке {link}
        или введите код <strong>{code}</strong> на странице {page}',
    'signUp-text' => 'Вы успешно зарегистрированы на сайте Виртуальной Хоккейной Лиги под логином {login}.
        Чтобы завершить регистрацию подтвердите свой email по ссылке {link} или введите код {code} на странице {page}',
];
