<?php

return [
    'h1' => 'Активация аккаунта',
    'link-repeat' => 'Мне не пришло письмо',
    'submit' => 'Активировать аккаунт',
    'text' => '<p>
            <strong>Активировать свой аккаунт</strong> - это значит подтвердить,
            что указанный при регистрации почтовый ящик принадлежит вам и работает.<br/>
            Только после этого вы сможете полностью пользоваться функциями сайта.
        </p>
        <p>
            Для активации своего аккаунта вам нужно ввести код активации,
            который был отправлен вам по электронной почте.
        </p>',
];
