<?php

return [
    'h1' => 'Регистрация в игре',
    'submit' => 'Начать карьеру менеджера',
    'text-1' => '<p>
            Ваша <strong>карьера тренера-менеджера</strong>
            в Виртуальной Хоккейной Лиге начинается прямо здесь и сейчас.<br/>
            Для того, чтобы мы могли отличить вас от других игроков, придумайте себе
            <strong>логин</strong> и <strong>пароль</strong>:
        </p>',
    'text-2' => '<p>
            На <strong>ваш e-mail</strong> отправится код активации аккаунта.
            Потом туда можно запросить пароль, если вы его забудете:
        </p>',
    'text-3' => '<p>
            Начиная карьеру менеджера, вы принимаете соглашение о пользовании сайтом.
        </p>
        <p>
            Обратите внимание, у нас запрещено играть одновременно под несколькими никами.
        </p>',
];
